{
  "timestamp": "2026-01-20T22:29:52.193853",
  "root_dir": "/home/techxero/Sites/XeroHub/content/updates",
  "files": {
    "/home/techxero/Sites/XeroHub/content/updates/submit-content/index.md": {
      "original_content": "---\ntitle: \"Submit Site Content\"\ndate: 2024-06-28\ndraft: false\ndescription: \"Submit New, Guides, Tools\"\ntags: [\"XeroLinux\", \"Site\", \"Content\"]\n---\n### Intro\n\nSo, I was thinking, why be the only one submitting content for the site ? This site is now a place to post **Linux** news, guides, and tools among other stuff. It's all for sharing our love for **FOSS**.\n\n### How to create content\n\nIn case you feel like doing a write up that you think would be useful to others, you can do that, and guess what, it's super easy... It's just a single *markdown* file called `index.md` which contains the text and an image called `featured.png` inside a folder named `post-title`. That's it ! Once that's done you zip them n send my way when I will go through it clean it up n publish...\n\n**- Folder contents**\n\n![Image1](https://i.imgur.com/nBUbAZg.png)\n\n**- Markdown contents**\n\n![Image2](https://i.imgur.com/sdCCPtn.png)\n\nDon't forget to update the date of the post in `date:`, also give it a short descriptive `title:` with a good `description`. Finally use the right `tags:` as shown in the screenshot. If in doubt click this  to check >> [**Template**](https://github.com/xerolinux/XeroHub/tree/main/content/posts/spotube-for-spotify)\n\nWith that out of the way, for more information about the various supported **Shortcodes** you can use, you can find them here >> [**BlowFish Shortcodes**](https://blowfish.page/docs/shortcodes/).\n\nThanks again & Cheers :heart:\n",
      "downloaded_images": [
        "nBUbAZg.png",
        "sdCCPtn.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/updates/browser-situation/index.md": {
      "original_content": "---\ntitle: \"Browser Situation\"\ndate: 2025-03-10\ndraft: false\ndescription: \"XeroLinux Browser Situation\"\ntags: [\"XeroLinux\", \"Browser\", \"Firefox\", \"ArchLinux\", \"FOSS\", \"Linux\"]\n---\nHey there...\n\nAlright, buckle up, fellow Linux enthusiasts! Let's dive into the rollercoaster that **XeroLinux** has been riding with its browser choice.\n\n{{< alert icon=\"fire\" cardColor=\"#e63946\" iconColor=\"#1d3557\" textColor=\"#f1faee\" >}}\n**Please** : We kindly request that you refrain from turning this into a political debate, it's not. We are just a small project trying to be as neutral as possible. Thank you ;)\n{{< /alert >}}\n\n### Current Glitch\n\nSo, **Mozilla**, in their infinite wisdom, decided to drop a new Terms of Use (TOU) for **Firefox** back in February 2025. They said it was to be more transparent, but it ended up being about as clear as mud, causing a full-blown user revolt. The original wording made it sound like Mozilla wanted a \"nonexclusive, royalty-free, worldwide license\" to all your precious data. Naturally, this raised eyebrows faster than you can say \"privacy breach,\" and comparisons to other data-hungry giants were inevitable. Check out this video that pretty much sums it up:\n\n{{< youtube 95HAb5oKNOg >}}\n\nMozilla, realizing they'd stepped in it, quickly backtracked and clarified that they just needed the necessary rights to make Firefox work, not to claim your data as their own. They updated the language to emphasize the limited scope, but the initial kerfuffle had already left a mark.\n\n### A Fork in the Road\n\nHere at the **XeroLinux HQ**, we thought, \"Hey, let's let the users decide!\" So, we ran a poll, and the winner was [**LibreWolf**](https://librewolf.net), a browser known for its privacy focus. Seemed like a solid choice, right?\n\n![LibreWolf](https://i.imgur.com/xOYZ3JZ.jpeg)\n\nWrong! This decision detonated a digital war between LibreWolf's supporters and those with concerns about its developer and philosophy. It was like watching two factions battle it out in an MMORPG, and we were caught in the crossfire.\n\n### Neutrality Patch\n\nHere's the thing: no matter which *big name browser* we pick, someone's going to have a problem with it. We can't win this game. But not including any browser at all? That's a recipe for a user riot.\n\nSo, we're hitting the reset button and sticking to \"placeholder\" browsers while still offering a wide selection for you to install later. Think of it as choosing a character class in a game – you get a basic one to start, but you can always switch to a more specialized one later.\n\n{{< youtube SMQc4umq3gg >}}\n\nFor the **Gnome** spin, we're going with [**Epiphany**](https://apps.gnome.org/Epiphany/), and for **KDE Plasma**, it's [**Falkon**](https://www.falkon.org). These browsers are native to their respective desktop environments and, more importantly, politically neutral. This keeps us out of the browser wars and aligns with our project's philosophy.\n\n### Bottom Line\n\nWe're hoping this change will finally calm things down for good. These placeholder browsers are just there to get you started. After that, you can grab your favorite from our toolkit **No Judgement !** We'll keep adding more over time.\n\n![Browsers](https://i.imgur.com/k0gin7l.png)\n\nIf you don't see your preferred browser on our list, don't panic! Just head over to [**Flathub**](https://flathub.org), the [**AUR**](https://aur.archlinux.org), or the official **Arch Repos** and install it from there.\n\nIt's that simple! We apologize for the drama, but this was necessary to avoid endless arguments and political debates. Thanks for sticking with us, and we appreciate your understanding.\n\nKeep on hacking!\n\n",
      "downloaded_images": [
        "xOYZ3JZ.jpeg",
        "k0gin7l.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/updates/help-needed/index.md": {
      "original_content": "---\ntitle: \"Help Needed\"\ndate: 2024-08-13\ndraft: false\ndescription: \"XeroLinux Needs Your Help\"\ntags: [\"XeroLinux\", \"Help\", \"Design\", \"ArchLinux\", \"Merch\", \"Linux\"]\n---\nHey there...\n\nThis is a new type of post. Please read on to understand what it's all about. **XeroLinux** urgently needs your help.\n\n### Designers needed\n\nWe here, at the **XeroLinux HQ** are looking for designers who will help us bring life to our upcoming **Merch Store**. Yes, you read this right, we are looking to expand our portfolio, adding cool merch that everyone can purchase, as an alternative or additional way to support the project.\n\nI am no designer, nor do I have a high quality logo to start with, just a very low quality one, maybe it can be used for inspiration. Also I am not looking at offering every type of item under the sun, just a few that might be interesting to the **FOSS** oriented crowd.\n\n### Service Chosen\n\nThe service I have chosen is [**FourthWall**](https://fourthwall.com). I chose this one because Matt from [**TheLinuxCast**](https://thelinuxcast.org) recommended it, and I trust his choice. I am new to all this, so I have **NO** idea what am doing. That's why your help is needed.\n\n![Image](https://i.imgur.com/Ho4o9GK.png)\n\nI have already set up the domain, and added a few basic items with my logo, so now all that's missing is more high quality merch lol. However it's a good start I guess. So if you can help add more and have some cool FOSS meme ideas we can print, let me know.\n\n### Compensation\n\nWell, since I am based in Lebanon, it will be very difficult for me to compensate you directly for any services rendered. However we can always reach some sort of understading. We will dicuss this behind the scenes.\n\n### Wrapping up\n\nSo now that you know what I am looking for, and are interested, feel free to contact me either on [**Fosstodon**](https://fosstodon.org/@XeroLinux) or by emailing me directly via this [**E-mail**](mailto:techxero@vivaldi.net?subject=XeroLinux%20Merch%20Design). I am looking forward to our collab should it happen.\n\nCheers !\n",
      "downloaded_images": [
        "Ho4o9GK.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/updates/xero-wayland/index.md": {
      "original_content": "---\ntitle: \"XeroLinux Moves to Wayland\"\ndate: 2025-06-23\ndraft: false\ndescription: \"Wayland by default\"\ntags: [\"XeroLinux\", \"Distro\", \"Wayland\", \"X11\"]\n---\n## Intro\n\nWe’re excited to announce that **XeroLinux** is moving forward, from now on, all releases will be **Wayland-only**! For those curious, you can learn more about [**Wayland**](https://wayland.freedesktop.org) and the legacy [**X11**](https://en.wikipedia.org/wiki/X_Window_System) systems via these links.\n\nThis change marks a major step toward a faster, more secure, and modern desktop experience. **X11** (or X.Org) has served the Linux community well for decades, but it’s showing its age and is no longer actively maintained. By embracing **Wayland**, we’re ensuring **XeroLinux** remains at the forefront of innovation and stability.\n\n{{< youtube iCU4W5Ab33c >}}\n\nWe’re also aware of the recent [**XLibre**](https://github.com/X11Libre/xserver) fork. While we respect the passion behind such projects, we prefer to focus our energy on building a positive, forward-thinking community, free from unnecessary drama.\n\n## Get X11 Back\n\nAlthough **XeroLinux** no longer includes **X11** support by default, especially on our **KDE** flagship, you still have the flexibility to bring it back if needed. If you require **X11** for compatibility reasons or personal preference, simply run the following command to reinstall it :\n\n```Bash\nsudo pacman -S kwin-x11 plasma-x11-session\n```\n\nThis ensures you can continue using **XeroLinux** your way, even as we move forward with **Wayland** as the default.\n\n## Wrap-Up\n\nRest assured, even though **X11** is no longer included by default in **XeroLinux**, our commitment to supporting all users remains unwavering. We will continue to offer assistance and guidance to anyone who needs help with **X11** setups or troubleshooting.\n\n<p align=\"center\">\n    <img width=\"750\" src=\"https://i.imgur.com/FeBe8gQ.png\" alt=\"X11\">\n</p>\n\nOur goal is to provide a smooth, enjoyable experience for everyone, whether you’re embracing the future with **Wayland** or relying on **X11** for your workflow. Together, we’re building a vibrant, inclusive community that thrives on innovation and support.\n\nCheers :heart:\n",
      "downloaded_images": [
        "FeBe8gQ.png"
      ]
    }
  }
}