{
  "timestamp": "2026-01-20T22:23:16.705486",
  "root_dir": "/home/techxero/Sites/XeroHub/content/posts",
  "files": {
    "/home/techxero/Sites/XeroHub/content/posts/flatpak-theming/index.md": {
      "original_content": "---\ntitle: \"Theming Flatpaks\"\ndate: 2024-06-27\ndraft: false\ndescription: \"Theme Flatpaks The Right Way\"\ntags: [\"Flatpak\", \"Theming\", \"Ricing\", \"Guide\", \"linux\"]\n---\n### Intro\n\nOne of the reasons why some users avoid installing Flatpak apps is that most Flatpak apps don’t change their appearance as per the current system theme. This makes the applications look out of the place in your otherwise beautiful set up.\n\nThe official way to apply GTK themes to Flatpak apps is by [installing the desired theme as a flatpak](https://docs.flatpak.org/en/latest/desktop-integration.html#theming). However, there are only a few GTK themes that can be installed as Flatpak.\n\nThis means that if you found a beautiful GTK theme, your Flatpak applications will still be using their default appearance. But wait! There is a workaround.\n\n{{< youtube IYXlgzrZRIE >}}\n\n## Tutorial\n\nIn this tutorial, I am going to introduce you a way to make Flatpak apps aware of external GTK themes.\n\nTo enable this functionality, users need to install the GTK themes similar to the one used in KDE (as for other distros) but also run these commands:\n\n**- Step 1:** Give Flatpak apps access to GTK themes location\n\nGTK themes are located in `/usr/share/themes` for all users, and in `~/.themes` for a specific user. Notice that you can’t give access to `/usr/share/themes` because according to [Flatpak Documentation](https://docs.flatpak.org/en/latest/sandbox-permissions.html#filesystem-access) they are blacklisted.\n\nSo, since all included GTK Themes in XeroLinux  are located under `/usr/share/themes` which Flatpaks cannot access we need to copy them to `~/.themes` .\n\nOnce that is done, to give all flatpak packages permission to access `~/.themes` run the following command:\n\n```Bash\nsudo flatpak override --filesystem=$HOME/.themes\n```\n\n**- Step 2:** Enable System-Wide Flatpak Override\n\nNow we need to apply a system-wide override telling Flatpaks to use whatever GTK theme system is using, it will be applied by default on next release of XeroLinux if it hasn't been already..\n\nCommands :\n\n```Bash\nsudo flatpak override --filesystem=xdg-config/gtk-3.0:ro\nsudo flatpak override --filesystem=xdg-config/gtk-4.0:ro\n```\n\nAlso sometimes that alone might not work, so you will need to set specific theme via...\n\n```Bash\nsudo flatpak override org.gnome.Calculator --env=GTK_THEME=name-of-gtk-theme\n```\n\nOnce that's done you will end up with a file in the system that includes those values. Seemingly enough there is some info about that exact issue on the [Flathub iisue reporter](https://github.com/flatpak/flatpak/issues/4633)..\n\nAs you can see in the screenshot below, there is two themes available, Ant-Bloody and Orchis-dark. Copy and paste the exact theme name in the above command:\n\n![[Image: uT6brUj.png]](https://i.imgur.com/uT6brUj.png)\n\nThis only applies to GTK3/4 based packages, for QT in most cases nothing needs to be done ![Wink](https://forum.xerolinux.xyz/images/smilies/wink.png \"Wink\")\n\nHere's the Original Thread on [Manjaro Forums](https://forum.manjaro.org/t/add-out-of-the-box-flatpak-gtk-application-themes-for-kde-plasma-users/117103)... Oh and [This Thread](https://itsfoss.com/flatpak-app-apply-theme/) Too....\n\n",
      "downloaded_images": [
        "uT6brUj.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/fix-grub/index.md": {
      "original_content": "---\ntitle: \"Grub Issues ?\"\ndate: 2024-06-27\ndraft: false\ndescription: \"How to fix Grub with Arch-Chroot\"\ntags: [\"repar\", \"chroot\", \"grub\", \"arch\", \"archlinux\", \"linux\"]\n---\n![[Image: FlfFJ0o.png]](https://i.imgur.com/FlfFJ0o.png)\n\n### Info\n\nIn case you are one of the affected people, below is how you can fix the issue. I have tested it and it works fine. And keep in mind that **XeroLinux** is basically **ArchLinux** so below fix will work on Arch as well as any Arch-Based distros with the exception of **Manjaro** that is *NOT* Arch. Read more on that >> [Here](https://wiki.manjaro.org/index.php/Manjaro:A_Different_Kind_of_Beast#:~:text=Manjaro%20is%20developed%20independently%20from,from%20its%20own%20independent%20repositories) <<\n\n### Disclaimer\n\nBelow guide covers EXT4/XFS/BTRFS Unencrypted Filesystems, for Encrypted Drives, you will have to either \"Google it\" lol, or check at the bottom of this guide where I posted a link to EndeavourOS' more advanced guide for Chrooting into your system... There are 2 options if first one works no need for the rest, and so on...\n\nAnyway here's what to do...\n\n### Mount Partition\n\nFirst of all, boot using either **Arch** or **XeroLinux** Live boot USB and follow the steps below. Any Linux ISO would do, but I do recommend and Arch based one to avoid any potential issues. \n\nThe device or partition with your Linux system on it will need to be mounted. To discover the kernel name of the storage device name, type:\n\n```Bash\nsudo fdisk -l\n```\n\nMount the device or partition : (replace \"sdXn\" with your Actual partition name)\n\n<div align=\"center\">\n\n  <img src=\"https://i.imgur.com/SZO4qw0.png\" />\n  \n</div>\n\nFor **EXT4** & **XFS**\n\n```Bash\nsudo mount /dev/sdXn /mnt (Linux Filesystem)\nsudo mount /dev/sdXn /mnt/boot/efi (EFI System)\n```\n\nFor **BTRFS**\n\n```Bash\nsudo mount -o subvol=@ /dev/sdXn /mnt (Linux Filesystem)\nsudo mount -o subvol=@ /dev/sdXn /mnt/boot/efi (EFI System)\n```\n\n### Arch-Chroot\n\nWith this information, you are able to arch-chroot, and to be able to do that you need to have root permissions, so type the following command:\n\n```Bash\nsudo arch-chroot /mnt\n```\n\n### Fix Grub boot\n\nNow you’ve chrooted into your installed system, and you are able to access your files, install packages, or alter scripts to rescue your system. to fix Grub run this in chroot...\n\n```Bash\nsudo grub-install --target=x86_64-efi --efi-directory=/boot/efi --force --recheck\n```\n\nthen update grub via below command\n\n```Bash\nsudo grub-mkconfig -o /boot/grub/grub.cfg\n```\n\nOr if you have `update-grub` installed\n\n```Bash\nsudo update-grub\n```\n\nExit arch-chroot via `exit` command then unmount your system n reboot. If you want to know more please check out EndeavourOS's [Advanced Chroot Guide](https://discovery.endeavouros.com/system-rescue/arch-chroot/2022/12/), they did a great job.\n\n```Bash\nsudo umount /mnt/boot/efi\nsudo umount /mnt\n```\n",
      "downloaded_images": [
        "SZO4qw0.png",
        "FlfFJ0o.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/install-yay-paru/index.md": {
      "original_content": "---\ntitle: \"Install Yay or Paru\"\ndate: 2024-06-27\ndraft: false\ndescription: \"Best Ways To Install Yay or Paru\"\ntags: [\"Yay\", \"Paru\", \"AUR\", \"Guide\", \"Linux\", \"Arch\", \"ArchLinux\"]\n---\n### What Are Those?\n\nYay & Paru are **AUR** Helpers. What's that ? Well, an **AUR** helper is a tool that automates the process of installing and managing packages from the Arch User Repository (AUR) on Arch Linux. The main purpose of AUR helpers is to simplify the installation and updating of AUR packages, which are not available in the official Arch Linux repositories\n\n![[Image: l2MiVr0.jpeg]](https://i.imgur.com/l2MiVr0.jpeg)\n\n### What is the difference between the two ?\n\nThe primary differences between the AUR helpers Yay and Paru lie in their underlying programming languages and some of their default settings and features. **Yay** is written in **Go**, while **Paru** is implemented in the more efficient **Rust** language, resulting in better performance. Additionally, Paru has some saner default settings, such as requiring users to review the PKGBUILD before installing a package, which is an important security consideration when working with the Arch User Repository. Yay, on the other hand, offers a unique \"--combinedupgrade\" flag that provides a color-coded output to distinguish between repository and AUR package upgrades, a feature not present in Paru. In terms of active development, Paru is currently more actively maintained than Yay, though both continue to receive updates and improvements. The choice between the two ultimately comes down to personal preference and specific needs when managing packages from the AUR..\n\n### Yay Installation :\n\n```Bash\ncd ~ && git clone https://aur.archlinux.org/yay-bin.git\ncd ~/yay-bin/ && makepkg -rsi --noconfirm\ncd ~ && rm -Rf ~/yay-bin/\n```\n### Yay Configuration :\n\n```Bash\nyay -Y --devel --save && yay -Y --gendb\nsed -i 's/\"sudoloop\": false/\"sudoloop\": true/' ~/.config/yay/config.json;\n```\n\nAnyway here's how to proceed for Paru...\n\n### Paru Installation :\n\n```Bash\ncd ~ && git clone https://aur.archlinux.org/paru-bin.git\ncd ~/paru-bin/ && makepkg -rsi --noconfirm\ncd ~ && rm -Rf ~/paru-bin/\n```\n### Paru Configuration :\n\n```Bash\nsudo sed -i -e 's/^#BottomUp/BottomUp/' -e 's/^#SudoLoop/SudoLoop/' -e 's/^#CombinedUpgrade/CombinedUpgrade/' -e 's/^#UpgradeMenu/UpgradeMenu/' -e 's/^#NewsOnUpgrade/NewsOnUpgrade/' /etc/paru.conf\necho \"SkipReview\" | sudo tee -a /etc/paru.conf > /dev/null\nparu --gendb;\n```\n\n###  Closing\n\nOnce that is done, you can use it to start installing packages from the [AUR](https://aur.archlinux.org). Keep in mind that you do not need to install both; just select the one you prefer, either one works.. I would recommend YaY myself though.. [ArchWiki Page](https://wiki.archlinux.org/title/AUR_helpers)\n",
      "downloaded_images": [
        "l2MiVr0.jpeg"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/enable-snaps/index.md": {
      "original_content": "---\ntitle: \"Enable Snaps on Arch\"\ndate: 2024-06-27\ndraft: false\ndescription: \"Custom Optimized nVidia Drivers\"\ntags: [\"Snaps\", \"SnapCraft\", \"Arch\", \"Guide\", \"Linux\"]\n---\n### What are Snaps ?\n\nSnaps are an innovative packaging format for distributing applications on Linux. Developed by **Canonical**, snaps are self-contained software bundles that include the app and all its dependencies. This allows snaps to work consistently across a wide range of Linux distributions, without compatibility issues. Snaps also use transactional updates, automatically rolling back if an update fails. Running in a secure sandbox, snaps have limited access to the host system, enhancing security. While some Linux users have reservations about Canonical's involvement, the snap format provides a convenient way to package and distribute applications that \"just work\" on any Linux desktop or server. For users and developers seeking a reliable, cross-distro packaging solution, snaps offer a compelling option to explore.\n\n### Disclaimer :\n\nSnap support was never intended to be used outside Ubuntu / Debian that package manager was created by Canonical for their Distribution and subsidiaries. Therefore  I will not be held responsible for any damage you incur by doing it. You will be on your own. Keep that in mind.\n\n### Installation\n\nWith that out of the way, I would recommend you look for your apps on either Arch Repos, AUR or Flathub first since those are the package managers officially supported on XeroLinux / Arch, but if you still insist on doing it, Do it at your own risk ! here's how to do it, follow the guide step by step, if you didn't miss anything you will be well on your way to start using Snaps.\n\n![[Image: BpMGL6X.png]](https://i.imgur.com/BpMGL6X.png)\n\n* Step 1 : Install & enable snapd service\n\nFirst things first, you will need to install `snapd` service and enable it. To do so please type the following commands in Terminal. Please report any issues to [Snapd Upstream](https://github.com/snapcore/snapd).\n\n```Bash\nparu -S --noconfirm snapd\nsudo systemctl enable --now snapd.socket\nsudo systemctl enable --now snapd.apparmor\n```\n\nMake sure to reboot the system after doing that for services to start correctly.\n\n* Step 2 : Install The Snap Store\n\nOnce that's done, either start installing your snaps via `sudo snap refresh && sudo snap install packagename` commands or if you prefer to use a GUI App Store install the aforementioned Snap Store via command below.\n\nInstall the Snap Store :\n\n```Bash\nsudo snap install snap-store\n```\n\nThis might take a while depending on your connection since it has to populate the massive database on first install, just be patient while it does that. Finally launch the store from the App-menu..\n\nI hope this helps y'all...\n",
      "downloaded_images": [
        "BpMGL6X.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/ohmyposh-p10k-replacement/index.md": {
      "original_content": "---\ntitle: \"Oh My Posh Prompt\"\ndate: 2024-07-08\ndraft: false\ndescription: \"A beautiful prompt for your $hell\"\ntags: [\"Prompt\", \"Shell\", \"ZSH\", \"Bash\", \"OhMyZsh\", \"OhMyPosh\", \"Linux\"]\n---\n\n{{< youtube 9U8LCjuQzdc >}}\n\n### Some information\n\n[**Oh My Posh**](https://ohmyposh.dev/) is a custom prompt engine for any shell that has the ability to adjust the prompt string with a function or variable. It’s beautiful, elegant and intuitive; if you use git from the command line it will be great for you.\n\nIt has several predefined themes that allow you to customize your prompt in a matter of seconds, it is also possible to create your own theme, it is compatible with BASH, PowerShell, CMD, Fish, Zsh and nushell is developed in golang and can be installed on **GNU/Linux**, **MacOS**, **Windows** and **Termux** (Android).\n\n![Prompt](https://i.imgur.com/jjSKX0P.png)\n\n### Installing Oh My Posh\n\nIn this guide we will be doing it on **ArchLinux** as is the norm. However it is possible to install on any other Distro, The package is available on the **AUR** so we will be installing it from there. Remember that if you have enabled the **ChaoticAUR** Repo you can use *pacman* instead. We have written an article on you can do that linked below.\n\n{{< article link=\"/posts/chaotic-aur/\" >}}\n\nWith that out of the way. now we can go ahead and install it with :\n\n```Bash\nparu -S oh-my-posh-bin\n```\n\nNow that it is installed, we need to activate it. In the video above, it was shown on `.zshrc` but the same can be done for `.bashrc`. Worry not though, I will be showing both. But before we do that, unlike video, we are not going to create a custom config, you are free to do so, will link you to the project **Git** at the end of this post where you can follow a more in-depth tutorial. We will be keeping it simple here.\n\nSo let's grab the one we like from >> [**OMP Theme Repo**](https://ohmyposh.dev/docs/themes)\n\n![Aliens](https://i.imgur.com/OL0pbr3.png)\n\n![NightOwl](https://i.imgur.com/EZmvwxa.png)\n\nTo grab it we will have to create the folder where we will be storing our selected config. We can do it either via our favorite file manager or Terminal. Since we are on **Arch** we gonna be **Terminal Ninjas** lol...\n\n```Bash\nmkdir -p \"$HOME/.config/ohmyposh\"\n```\n\nNow we need to selec the *Theme/Config* and put it there. For this example we will be using **Dracula**. Replace it with the one you have chosen from the link above.\n\n```Bash\ncurl -o \"$HOME/.config/ohmyposh/dracula.omp.json\" https://raw.githubusercontent.com/JanDeDobbeleer/oh-my-posh/main/themes/dracula.omp.json\n```\n\nOk, so now that we have our config, we need to *Activate* it.\n\nFor **Bash** we will have to edit our `.bashrc` by adding the following line to it :\n\n```Bash\neval \"$(oh-my-posh init bash --config $HOME/.config/ohmyposh/dracula.omp.json)\"\n```\n\nAs for **ZSH** we will have to edit our `.zshrc` by adding the following line to it :\n\n```Bash\neval \"$(oh-my-posh init zsh --config $HOME/.config/ohmyposh/dracula.omp.json)\"\n```\n\nThat's it ! Now if you had a shell/terminal window open, relaunch it n see **Oh My Posh** in action !!!!\n\n![Preview](https://i.imgur.com/GJiIrxm.png)\n\nOh, I forgot to mention that it also has its own set of commands * flags you can use. For example did you know that even if you have installed it from the **AUR/ChaoticAUR**, where sometimes they lag behind, you can update it using an internal command ? Here's how, might need to run with `sudo` :\n\n```Bash\noh-my-posh upgrade\n```\n\nHere's a list of all Flags/Commands :\n\n![Commands](https://i.imgur.com/DX1x5gP.png)\n\n**Note**\n\n> In case you were using the now on Life Support **Powerlevel10k**, as shown in the video, remove any mention of it from either `.bashrc` or `.zshrc`.\n\n### Closing words & thoughts\n\nIt's a shame to see a project like **Powerlevel10k** slowly die. But where one goes others are born from their ashes. Now **THAT**'s the beauty of Open Source.\n\n![Toolkit](https://i.imgur.com/tWgYv7k.png)\n\nAs you can see from the image above, for those of you out there using the **XeroLinux Post Install Toolkit**, we added the option that will do everything mentioned in this guide automatically for you.\n\nKeep in mind that this only applies to **Bash**, for anyone who prefers **Fish** that will always be *Vanilla* as for those of you, who, like myself love **ZSH**, well it is included with option **4. ZSH All-in-one w/OMP**...\n\n{{< github repo=\"xerolinuxdev/xlapit-cli\" >}}\n\nThere's nothing to say now, except that this project is awesome, I love it and hope it lives long an prosper. Now as mentioned earlier if you want to create your very own config, just head on over to the project's **Git** below or check out the >> [**OMP Docs**](https://ohmyposh.dev/docs/)\n\n{{< github repo=\"JanDeDobbeleer/oh-my-posh\" >}}\n\nThat’s it folks ..\n\nCheers !\n",
      "downloaded_images": [
        "jjSKX0P.png",
        "OL0pbr3.png",
        "DX1x5gP.png",
        "tWgYv7k.png",
        "EZmvwxa.png",
        "GJiIrxm.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/ricing-plasma/index.md": {
      "original_content": "---\ntitle: \"Ricing KDE Plasma\"\ndate: 2024-07-29\ndraft: false\ndescription: \"An introduntory guide to ricing KDE Plasma\"\ntags: [\"Plasma\", \"Ricing\", \"KDE\", \"KDE Plasma\", \"Guide\", \"Linux\"]\n---\n### Intro\n\nBefore we begin, here's brief intro as to why I care about ricing.\n\nIn case you didn't know it, I began my **Linux** journey with **KDE Plasma** because of the freedom of customization. I love ricing my setups. I hated that **macOS** & **Windows** did not allow this.\n\nAnd if you want to see what I have managed to do, well, hop on over to my **Layan** rice's **Githup** repository, you will get blown away.\n\n{{< github repo=\"xerolinux/xero-layan-git\" >}}\n\n### A bit of understanding\n\nRicing can be a bit invloved. At least if you are like me, and care about consistency. It's not about just slapping a desktop theme and calling it a day. That's just lazy. Please don't do that.\n\n![Rice](https://i.imgur.com/irOECxY.jpeg)\n\n**KDE Plasma** is a ricing a beast, no doubt about that. That's one of its biggest selling points. So it's normal when I say, it can be very, very intricate. You can rice everything in it.\n\nWe need to also know what library the system uses. **KDE** uses a library called **Qt**, pronounced like *cute*. But you might encounter apps that use the **GTK2/3/4** library, typically ones created for **Gnome** or **XFCE**.\n\n> Keep in mind though, to successfully theme **GTK4** or, as it's called now **LibAdwaita**, we need to make sure the necessary *Hacks* are included in the theme we have chosen, simply because, as we all know, **Gnome** devs despise the whole idea of theming for whatever reason.\n\nSo it will be up to you, the user, to find all theme elements required for a complete and consistent look. Whay do I say this you may ask? Well, quite simply because, and it saddens me to say this, very few themes come complete, allowing such consistency. But it can be done.\n\nWith that out of the way, let's get to it shall we ?\n\n### KDE Plasma pieces\n\nAs I said earlier in the post, **KDE Plasma** is made of many elements that can be themed or riced. So here, I will be explaining what they are and the tools we need to theme them.\n\n{{< alert icon=\"fire\" cardColor=\"#e63946\" iconColor=\"#1d3557\" textColor=\"#f1faee\" >}}\n**Friendly Advice :** Never install themes from any repos or the **AUR**. Always grab them from source, after you have inspected the code. For your own sanity. And make sure they are compatible with **Plasma 6**.\n{{< /alert >}}\n\nPlease read the above warning, ignoring it will result in nothing but headaches. Trust me, I made that mistake and wasted more time than I can count trying to solve the resulting issues.\n\n- **Kvantum Manager**\n\nFirst, we will need and app that I highly recommend to have on hand, called **Kvantum**. I consider it an essantial tool for every ricer out there.\n\n![Kvantum](https://i.imgur.com/DNfv0aG.png)\n\n{{< github repo=\"tsujan/Kvantum\" >}}\n\nThis will take care of the awesome window blur and transparency effects for all **Qt** based apps. It will not work on anything else, keep that in mind.\n\n- **SDDM Login Manager**\n\nAnother element **KDE Plasma** uses, is [**SDDM**](https://wiki.archlinux.org/title/SDDM) for its **Display Manager/Login**.\n\n![SDDM](https://i.imgur.com/hLBbJvF.jpeg)\n\nIt too can be themed.\n\n- **Grub Bootloader**\n\nNow, I can already hear you say that this is unrelated to **KDE Plasma**, to which I will say, yes I agree. Also, not everyone will be using [**Grub**](https://wiki.archlinux.org/title/GRUB). Also true.\n\n![Grub](https://i.imgur.com/tyoOZV1.png)\n\nBut for the sake of completeness, I do like to theme it as well.\n\n- **Konsole Terminal Emulator**\n\n[**Konsole**](https://konsole.kde.org/) is the *Terminal Emulator* that **Plasma** ships. I know most of you switch to **Alacritty** or even **Kitty**. But I prefer to stick with what ships with the DE I use.\n\n![Konsole](https://i.imgur.com/pXDM5ZM.png)\n\nThat too can be themed.\n\n### The more complete the better\n\nNow that we have an understanding of the various elements that make for a more complete experience, here's what themes we choose need to have before using them.\n\nNot all of them contain all the elements. Sadly there are some out there that are incomplete making it harder to get a cohesive look. So I would avoid those if I were you.\n\nOnce we have found a noce theme, we need to make sure it applies to the following parts of **Plasma** :\n\n- **Colors** : Resposible for accent and window colors.\n- **Application Style** : Theme specific Kvantum style.\n- **Plasma Style** : Light/Dark window style.\n- **Window Decorations** : The top window minimize/close/maximize bar.\n- **Cursors** : Cursor theme (Optional)\n- **Icons** : A fitting icon theme. (Optional)\n- **SDDM** : Login theme.\n\n![Settings](https://i.imgur.com/ggNKZYO.png)\n\nThat's it really. In case you do not find a theme that contains all these elements, it's not a huge issue, you can always hunt for one that fits the **Global Theme**. It's hard to find one I know, but who knows you might get lucky lol.\n\n### Applying our themes\n\nOnce you have downloaded your chosen theme and theme elements from their sources (Github/Gitlab), follow their respective guides to install them, then head on over to the **KDE Settings** to apply them.\n\nFor **Kvantum**, just launch it, select the theme from the drop down and hit apply. Then select it as the **Application Style**.\n\nAs for **Konsole**, launch it, make sure you have moved its theme file into `~/.local/share/konsole/` folder, right click inside its window, select *create new profile* from the context menu, give it a name, one that you recognize, on the left click on *appearance*, select your theme, if you want to enable transparency with blur, click on edit, this is where you do that. Confirm, done.\n\nNow I will not talk about **Grub** here since all themes for it will come with their own instructions and/or install scripts.\n\n### Panel & Widgets\n\nOh boy, the reason I will not be talking about those is is simple, it's your rice you do with those as you please. **KDE Plasma** comes with some awesome widgets, use those to get started, if you want more, well, you will find them on the [**KDE Store**](https://store.kde.org).\n\n{{< alert icon=\"fire\" cardColor=\"#e63946\" iconColor=\"#1d3557\" textColor=\"#f1faee\" >}}\n**Warning :** Please make sure they are compatible with **Plasma 6**.\n{{< /alert >}}\n\n![XeroLayan](https://i.imgur.com/VA2tycb.jpeg)\n\nAs for the panel, position it wherever your heart desires. Top, bottom, left or right. It's all up to you. You can even use it as a Dock. Above is the end result of my very own rice I call the **XeroLayan** rice.\n\n### Bonus for the G33ks\n\nAs a bonus, for all the G33ks out there, I would like to include a nice find. Some of us would love to make our rices reproduce-able without having to apply every element over and over, others just want to have a backup.\n\nThat's where this **Github Repo** comes in handy. It shows us what files are affected by the various theme elements. So have at it and enjoy !\n\n{{< github repo=\"shalva97/kde-configuration-files\" >}}\n\nDon't forget about **Konsave** the GUI tool that does exactly that, just in a much simpler way. Article attached below.\n\n{{< article link=\"/posts/konsave-tool/\" >}}\n\nThat's all se wrote folks. I hope this has helped you understand more of what ricing **KDE Plasma** is all about.\n\nCheers !\n",
      "downloaded_images": [
        "tyoOZV1.png",
        "DNfv0aG.png",
        "hLBbJvF.jpeg",
        "irOECxY.jpeg",
        "pXDM5ZM.png",
        "ggNKZYO.png",
        "VA2tycb.jpeg"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/fix-boot/index.md": {
      "original_content": "---\ntitle: \"Fix Unbootable System\"\ndate: 2024-06-28\ndraft: false\ndescription: \"Fix a Broken Update\"\ntags: [\"Boot\", \"Kernel\", \"Grub\", \"Guide\", \"Linux\"]\n---\n### Preface\n\nAre you having an issue after updating your system with the message `vmlinuz-linux not found`? Watch the video below by Erik Dubois, should help you get out of that predicament ...\n\n{{< youtube NfMbs9zzkDw >}}\n\n### Disclaimer :\n\nBelow guide covers EXT4/XFS/Unencrypted Filesystems, for Encrypted Drives, you will have to \"Google it\" lol,\n\nAnyway here's what to do...\n\n### Mount your system to work in..\n\nFirst of all boot using your XeroLinux Live boot USB and follow the steps below...\n\nThe device or partition with your Linux system on it will need to be mounted. To discover the kernel name of the storage device name, type:\n\n```Bash\nsudo fdisk -l\n```\n\nMount the device or partition : (replace \"sdXn\" with your actual partition name)\n\n![[Image: SZO4qw0.png]](https://i.imgur.com/SZO4qw0.png)\n\nFor EXT4 & XFS\n\n```Bash\nmount /dev/sdXn /mnt (Linux Filesystem)\nmount /dev/sdXn /mnt/boot/efi (EFI System)\n```\n\n### Chroot into your system :\n\nWith this information, you are able to arch-chroot, and to be able to do that you need to have root permissions, so type the following command:\n\n```Bash\narch-chroot /mnt\n```\n\n### Reinstall missing Kernel :\n\nNow it's time to get the Kernel back in order to get the system to boot once again.. Do this now...\n\n```Bash\npacman -S linux linux-headers\n```\n\nFinally update the system if needed...\n\n```Bash\npacman -Syyu\n```\n\nExit arch-chroot via `exit` command then unmount your system\n\n```Bash\numount /mnt/boot/efi\numount /mnt\n```\n\nNow reboot all should be good...\n\nHope this helps\n",
      "downloaded_images": [
        "SZO4qw0.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/build-archiso/index.md": {
      "original_content": "---\ntitle: \"Build a Fresh Arch ISO\"\ndate: 2024-09-05\ndraft: false\ndescription: \"Easy Guide to Building a Fresh Arch ISO\"\ntags: [\"Arch\", \"ArchLinux\", \"ArchISO\", \"Linux\"]\n---\n### Information\n\nSick & Tired of waiting a whole month before you can grab a fresh copy of the **Arch** ISO ? Well fear not coz this guide will help you build a fresh one. I mean we can always grab the ISO  from the [**ArchLinux**](https://archlinux.org/download/) site as outdated as it can be. Still knowing how to build a fresh one can be useful in a bind, am I right ?\n\n<p align=\"center\">\n    <img width=\"500\" src=\"https://i.imgur.com/QWqMIsr.png\" alt=\"logo\">\n</p>\n\n### Let's do this\n\nFirst off we need to grab a few packages in order to be able to build the ISO. Keep in mind that in order to do this you must be on **Arch**. In case you aren't, that's where [**Distrobox**](https://distrobox.it/compatibility/) comes in really handy.\n\n```Bash\nsudo pacman -S archiso\n```\n\nNow we need create two folders in our home directory or anywhere else, up to you, one called `ArchWork` for placing extracted files, another called `ArchOut` where final ISO will be located.\n\n```Bash\nmkdir ~/ArchWork && mkdir ~/ArchOut\n```\n\nNow that it's all done we can proceed to building a fresh new & updated **ArchISO**. Just use the command below and watch the magic happen.\n\n```Bash\nsudo mkarchiso -v -w ~/ArchWork -o ~/ArchOut /usr/share/archiso/configs/releng\n```\n\nFinally we can delete the work directory to save space. just do `sudo rm -rf ~/work/`.\n\n### Wrapping up\n\nIn case you are using the **XeroLinux** toolkit or Distro, make sure to update, coz as is my nature, I added the option to do that with a single click. Test it out and as is the norm by now, if you encounter any issues report them on **Github**.\n\n<p align=\"center\">\n    <img width=\"100%\" src=\"https://i.imgur.com/FcsiONm.png\" alt=\"logo\">\n</p>\n\nNow that we have an idea on how to build the **Arch ISO**, You can take it to another level. Yes, this is how most *Arch-Based* distros like **XeroLinux** began. Just keep in mind that getting the `DE/WM` you want on the ISO requires a lot more work.\n\nHave fun, I know I will 🚀\n",
      "downloaded_images": [
        "QWqMIsr.png",
        "FcsiONm.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/chroot-guide/index.md": {
      "original_content": "---\ntitle: \"Chroot Guide\"\ndate: 2024-06-27\ndraft: false\ndescription: \"Troubleshoot using Chroot\"\ntags: [\"Chroot\", \"Troubleshooting\", \"Arch\", \"Guide\", \"linux\"]\n---\n### Info\n\n![[Image: jll2heu.png]](https://i.imgur.com/jll2heu.png)\n\nChanging Root (Chroot) is the process of changing of the apparent disk root directory (and the current running process and its children) to another root directory. When you change root to another directory you cannot access files and commands outside that directory. This directory is called a “chroot jail”. Changing root is commonly done for system maintenance for such tasks as reinstalling GRUB or resetting a forgotten password. Changing root is often done from a LiveCD or LiveUSB into a mounted partition that contains an installed system.\n\n### Requirements\n\n* You’ll need to boot to another working Linux environment (for example, to a LiveCD or USB flash disk).\n* Root privileges are required in order to chroot.\n* Be sure that the architectures of the Linux environment you have booted into matches the architecture of the root directory you wish to enter (i.e. i686, x86\\_64). You can find the architecture of your current environment by: `uname -m`\n* If you need any kernel modules loaded in the chroot environment, load them before chrooting. It may also be useful to initialize your swap (`swapon /dev/<device-or-partition-name>`) and to connect to your network before chrooting.\n\n### Mounting the device\n\nThe device or partition with the Linux system on it will need to be mounted. To discover the kernel name of the storage device name, type:\n\n```Bash\nfdisk -l\n```\n\nCreate a directory where you would like to mount the device or partition, then mount it:\n\n```Bash\nsudo mkdir /mnt/xero\nsudo mount /dev/device_or_partition_name /mnt/xero\n```\n\nFor LUKS encrypted devices, mount won’t work, use `udisksctl` instead, first unlock the device (all commands as regular user):\n\n```Bash\nsudo udisksctl unlock -b /dev/device_or_partition_name\n```\n\nGet the device mapper name:\n\n```Bash\nls - la /dev/mapper\n```\n\nthen mount the returned mapper:\n\n```Bash\nudiskctl mount -b /dev/mapper/mapper_name\n```\n\n### Changing Root\n\nMount the temporary filesystems:\n\n```Bash\ncd /mnt/xero\nsudo mount -t proc proc proc/\nsudo mount -t sysfs sys sys/\nsudo mount -o bind /dev dev/\n```\nMount other parts of your filesystem (e.g. /boot, /var, /usr…) that reside on separate partitions but which you need access to. For example:\n\n```Bash\nsudo mount /dev/device_or_partition_name boot/\n```\n\nIt’s possible to mount filesystems after you’ve chrooted, but it’s more convenient to do so beforehand. The reasoning for this is you’ll have to unmount the temporary filesystems after you exit a chroot so this lets you unmount all the filesystems in a single command. This also allows a safer shutdown. Because the external Linux environment knows all mounted partitions it can safely unmount them during shutdown.\n\nIf you’ve setup your network and want to use it in the chroot environment, copy over your DNS servers so that you will be connected to the network:\n\n```Bash\ncp -L /etc/resolv.conf etc/resolv.conf\n```\n\nNow chroot to your installed device or partition and define your shell:\n\n```Bash\nsudo chroot . /bin/bash\n```\n\nIf you see the error, `chroot: cannot run command '/bin/bash': Exec format` error it is likely the two architectures do not match.\n\nIf you’ll be doing anything with GRUB inside the chroot environment, you’ll need to be sure your /etc/mtab is up-to-date:\n\n```Bash\nsudo rm /etc/mtab && grep -v rootfs /proc/mounts > /etc/mtab\n```\n\nIf you use bash, your root $HOME/.bashrc will be sourced on login provided your ~/.bash\\_profile specifies it (source ~/.bashrc). To source your chrooted, global bash configuration do:\n\n```Bash\nsource /etc/profile\n```\n\nIf your bash configuration doesn’t use a unique prompt, consider creating one to be able to differentiate your chroot environment:\n\n```Bash\nexport PS1=\"(chroot) $PS1\"\n```\n\n### Perform System Maintenance\n\nAt this point you can perform whatever system maintenance you require inside the chroot environment, some common examples being:\n\n* Upgrade or downgrade packages\n* Rebuild your initcpio image\n* Reset a forgotten password\n* Fix your /etc/fstab\n* Reinstall GRUB\n\nWith this information, you are able to arch-chroot, and to be able to do that you need to have root permissions, so type the following command:\n\nThen type the following:\n\n```Bash\nsudo arch-chroot /mnt/xero\n```\n\nNow you’ve chrooted into your installed system, and you are able to access your files, install packages, or alter scripts to rescue your system.\n\nTo make sure `arch-chroot` is working check after your users home folder ls `/home` that should give your username from the installed system.\n\n### Exiting chroot\n\nWhen you’re finished with system maintenance, exit the chroot shell:\n\n```Bash\nexit\n```\n\nThen unmount the temporary filesystems and any mounted devices:\n\n```Bash\numount {proc,sys,dev,boot...}\n```\n\nFinally attempt to unmount your hard drive:\n\n```Bash\ncd ..umount xero/\n```\n\nIf you get an error saying that '/mnt' (or any other partition) is busy, this can mean one of two things:\n\n* A program was left running inside of the chroot.\n* Or more frequently: a sub-mount still exists. For example, `/mnt/xero/usr` within `/mnt/xero`.\n\nIn the latter case, unmount the sub-mount mount point first. To get a reminder of all the current mount points, run mount with no parameters. If you still are unable to unmount a partition, use the force option:\n\n```Bash\numount -f /mnt\n```\n\nAfter this you will be able to safely reboot.\n",
      "downloaded_images": [
        "jll2heu.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/ollama-ai/index.md": {
      "original_content": "---\ntitle: \"Ollama A.I\"\ndate: 2024-09-20\ndraft: false\ndescription: \"Run A.I. Locally On Your Computer With Ollama\"\ntags: [\"AI\", \"Ollama\", \"Assistant\", \"Linux\"]\n---\n\n### Information\n\n[**Ollama**](https://ollama.com) is a tool that allows you to run and manage *A.I.* models locally on your own machines, providing privacy and control without relying on *cloud-based* services. While it works across multiple platforms, it integrates smoothly into any **Linux** workflow.\n\n{{< youtube J6s0n1FhXRo >}}\n\n### Installation\n\nInstalling is easy, it can be done in multiple ways, that I will show you here. In the video above my good friend and brother [**DistroTube**](https://www.youtube.com/@DistroTube/videos) goes through the motions on **ArcoLinux** an **Arch-Based** distro. Here, I will expanding on that just a little, while including most of the commands used.\n\nFirst we will need to install the **Ollama Engine**...\n\n- Platform-Agnostic (Recommended)\n\n```Bash\ncurl -fsSL https://ollama.com/install.sh | sh\n```\n\n- ArchLinux (All Spins)\n\n```Bash\nsudo pacman -S ollama && sudo systemctl enable --now ollama\n```\n\nNow that we have the engine installed, it's time to grab the model we want to use with it, since without one it will not work properly. There are quite a few varying in size, be mindful of that.\n\nWe can select model(s) from [**This Link**](https://github.com/ollama/ollama?tab=readme-ov-file#model-library), once we have it we use the following command to install and run (using llama3.1 in this example)...\n\n```Bash\nollama run llama3.1\n```\n\nSome models are larger than others, reaching up to 232GB !!! Also the bigger the model is the more powerful your machine should be to handle it. Please keep that in mind before diving too deep into it.\n\n<p align=\"center\">\n    <img src=\"https://i.imgur.com/uIJ7AO4.png\" alt=\"shot\">\n</p>\n\nOh and as mentioned by **DT** in the video, you can take it to the next level by customizing it, making it react using different personas, like **Mario** or any of the available ones. This is just a quirk not very useful. If you want to know how, check it out on project's **Github**\n\n{{< github repo=\"ollama/ollama\" >}}\n\n### Wrap up\n\nThat's it. There's nothing to it. A.I. is where the world is headed so I thought I'd share this with y'all. It's fun to try new things, keeping up with technology. If you have any questions or issues please report them to the Devs upstream.\n\nCheers !\n",
      "downloaded_images": [
        "uIJ7AO4.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/zed-ide/index.md": {
      "original_content": "---\ntitle: \"Zed Rust based IDE\"\ndate: 2024-07-11\ndraft: false\ndescription: \"GPU Accelerated IDE\"\ntags: [\"Zed\", \"IDE\", \"Dev\", \"Developers\", \"Atom\", \"Linux\"]\n---\n\n{{< youtube JGz7Ou0Nwo8 >}}\n\nA quick one for today. I stumbled upon this new IDE called **ZED**, and I thought I'd share it with y'all.\n\nThe *Linux* version has been in development for a while, they just announced its availablability via their >> [**Linux when? Linux now**](https://zed.dev/blog/zed-on-linux) post...\n\n### Some Information\n\n[**Zed**](https://zed.dev) is a high-performance, open-source code editor built using the Rust programming language. Here are the key points about Zed:\n\n- **Built with Rust:** Zed is written entirely in **Rust**, a systems programming language known for its speed, safety, and concurrency features. This allows Zed to offer superior performance compared to many other code editors.\n- **Fast and Responsive:** Zed's innovative GPU-based user interface (GPUI) framework allows it to efficiently leverage the GPU to provide an incredibly fast and responsive coding experience, with instant file loading and smooth UI updates.\n- **Collaborative Coding:** Zed supports real-time collaboration, allowing multiple developers to work on the same codebase simultaneously from different locations.\n- **Customizable:** Zed provides a range of customization options, including themes, plugins, and adjustable settings, allowing developers to tailor the editor to their specific needs and workflows.\n- **Open-Source:** Zed was open-sourced in 2024 and is available under the MIT license, allowing developers to contribute to its development and extend its functionality.\n- **Cross-Platform:** Zed is currently available for macOS, with plans for Linux support in the future. Windows support is not yet available.\n\nIn summary, Zed is a modern, high-performance code editor built using the Rust programming language, offering developers a fast, collaborative, and customizable coding experience. Its open-source nature and focus on performance and productivity make it an exciting new option in the code editor landscape.\n\n### Extension Support\n\nZed's extension support is a key aspect of its customizability and flexibility as a code editor. While Zed is built on a robust core, its true power lies in the ability to extend its functionality through a vibrant ecosystem of plugins and extensions.\n\nDevelopers can tap into a growing library of community-contributed extensions that add support for a wide range of programming languages, integrate with popular tools and services, and enhance the overall coding experience. From syntax highlighting and code formatting to advanced debugging and deployment workflows, Zed's extension system allows users to tailor the editor to their specific needs.\n\n![Zed](https://i.imgur.com/r8icrSg.png)\n\nThe extension system is designed to be intuitive and easy to use, with a straightforward process for discovering, installing, and managing extensions directly within the Zed interface. This empowers developers to quickly find and implement the tools and features they require, without the need for complex configuration or external setup.\n\nAs Zed continues to gain traction and attract a dedicated user base, the extension ecosystem is expected to flourish, with more and more developers contributing their own custom extensions and integrations. This extensibility is a key factor that sets Zed apart, allowing it to evolve and adapt to the changing needs of modern software development.\n\n### Assistant integrations\n\nZed's assistant integration is a key feature that allows developers to seamlessly collaborate with AI language models within the code editor. Here are the main points about Zed's assistant capabilities:\n\n- **Conversational Interface:** Zed provides a dedicated assistant editor panel that functions similar to a chat interface. Users can type prompts and queries, and the assistant's responses are displayed in real-time below.\n- **Multiple Roles:** The assistant editor supports different message blocks for the \"You\", \"Assistant\", and \"System\" roles, allowing for structured conversations and context management.\n- **Customizable Models:** Zed allows users to select the AI model they want to use, including options like OpenAI's GPT models and Anthropic's Claude. Users can also specify custom API endpoints for the models.\n- **Code Interaction:** The assistant can interact with code snippets, with users able to easily insert code from the editor into the conversation and have the assistant provide feedback or generate new code.\n- **Prompt Library:** Zed includes a prompt library feature that allows users to save and reuse custom prompts to guide the assistant's responses, including a \"default prompt\" that sets the initial context.\n- **Streaming Responses:** Responses from the assistant are streamed in real-time, and users can cancel the stream at any point if the response is not what they were expecting.\n\nOverall, Zed's assistant integration provides a seamless way for developers to leverage the capabilities of large language models directly within their coding workflow, enhancing productivity and collaboration.\n\n### Installing & configuring Zed\n\nIt's available on the **Arch Extra Repos**, you can easily install it from there via :\n\n```Bash\nsudo pacman -S --needed zed\n```\n\n- **Configure Zed**\n\nUse `⌘ + ,` to open your custom settings to set things like fonts, formatting settings, per-language settings, and more. You can access the default configuration using the `Zed > Settings > Open Default Settings` menu item. See Configuring Zed for all available settings.\n\n- **Set up your key bindings**\n\nYou can access the default key binding set using the `Zed > Settings > Open Default Key Bindings` menu item. Use `⌘ + K`, `⌘ + S` to open your custom keymap to add your key bindings. See [**Key Bindings**](https://zed.dev/docs/key-bindings.html) for more info.\n\nTo all you `Vim` users out there visit the => [**Vim Docs**](https://zed.dev/docs/vim.html).\n\n⌘ => Super Key\n\n### What I think of it\n\nI love this thing. It's slowly replacing my current IDE **Kate**. It's more flexible, cutomizable and most importantly it's got **GPU Acceleration** where Kate doesn't, at least not as well. Oh it's also super lightweight.\n\nWhile it's not as the video says, a 1:1 **VSCode** replacement, with some lacking features, it's getting there. It's relatively new, so I only see good things in its future, it just needs time to cook.\n\nHowever, it already includes support for the main plugins I, myself care about, like **Git**, **Docker Compose**, **Toml**, **Yaml**, **Make**, **Java**, **Bash**, **Markdown** among others, with more in the pipeline...This post was written using it BTW...\n\nAnd if you know me by now I love its theme engine, with the likes of **Dracula**, **Catppuccin**, **Nord**, **Synthwave '84** among others already available to install.. It's one of the main things that attracted me to it lol. Nothing else to say about it except that I highly recommend you give it a try.\n\nIt has way more than what I mentioned here, so if you want to know more about it, either go to the >> [**Docs/Wiki**](https://zed.dev/docs/) page, or visit their **Git Repo** below.\n\n{{< github repo=\"zed-industries/zed\" >}}\n\nThat’s it folks ..\n\nCheers !\n",
      "downloaded_images": [
        "r8icrSg.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/docker-usage/index.md": {
      "original_content": "---\ntitle: \"Docker & Docker-Compose\"\ndate: 2024-06-27\ndraft: false\ndescription: \"How To Use Docker in a Nit-Shell\"\ntags: [\"Docker\", \"Docker-Compose\", \"Tools\", \"Containers\", \"Linux\", \"Guide\"]\n---\n### Intro\n\nAfter messing with [Docker](https://www.docker.com) Containers for so long, I thought I would share the knowledge. Hopefully a video showing it in action soon. In this short tutorial we will be using the Docker Compose feature to deploy our containers. Just note we can do so much more, but this is just an introductory guide, you will have to discover the rest on your own. It's so much fun trust me. To get an idea how much I love them click [**Here**](https://blog.xerolinux.xyz/2024/06/docker-containers-a-love-story/) to read my thoughts...\n\n![[Image: bbD4JDy.png]](https://i.imgur.com/bbD4JDy.png)\n\nSo without further delay let's gooooooooo...\n\n### What are Docker containers ?\n\nDocker containers are lightweight, portable units that package an application and its dependencies, ensuring consistent performance across different environments. Unlike virtual machines, containers share the host OS kernel, making them more efficient and faster to start.\n\n### Key Points:\n\n* Isolation: Containers run in isolated environments, using the host system’s resources without interference.\n* Portability: Containers can be run anywhere with Docker installed, solving the \"it works on my machine\" issue.\n* Efficiency: They use fewer resources than VMs since they don’t need a full OS for each instance.\n* Consistency: Ensures the same environment across development, testing, and production.\n* Scalability: Easily scalable with tools like Kubernetes, perfect for microservices.\n\n### How It Works:\n\n1. Dockerfile: Script defining how to build a Docker image.\n2. Build: Create an image from the Dockerfile.\n3. Run: Start a container from the image.\n4. Manage: Use Docker commands to handle the container lifecycle.\n\nDocker containers streamline development, improve resource utilization, and simplify deployment, making them ideal for modern application development.\n\n### Install Docker Package\n\nBefore we can deploy our container(s) we will need to install docker and its dependencies then enable the service. To do so type this in terminal (ArchLinux) :\n\n```Bash\nsudo pacman -S docker docker-compose\n```\n\nNow that we have Docker installed we will need to add ourselves to the Docker group and start the service. Do it like this :\n\n```Bash\nsudo usermod -aG docker $USER\nsudo systemctl enable --now docker\n```\n\n### Docker Compose file (Stack)\n\nOk, now that everything's set, we can go container hunting... I would highly recommend sites like, [SelfH](https://selfh.st/apps/) or [AwesomeSelfHosted](https://awesome-selfhosted.net). But for the sake of this tutorial, I will be showing you an example docker compose file from one of the services found there. I have selected [FileBrowser](https://demo.filebrowser.org/) (User : demo / Pass : demo)\n\nHere's the docker compose file contents. Just create a folder called \"FileBrowser\", then inside it a file called \"compose.yml\" inside it paste the following :\n\n```Yaml\nservices:\n  filebrowser:\n    image: hurlenko/filebrowser\n    user: \"1000:1000\"\n    ports:\n      - 443:8080\n    volumes:\n      - /<path-to-shared-folder>:/data\n      - ./config:/config\n    environment:\n      - FB_BASEURL=/\n    restart: always\n```\n\nJust make sure to change the \"443\" port to one you prefer without touching part to the right which is the internal Docker one. Also in the \"Volumes\" section change the \"- /<path-to-shared-folder>:/data\" part, do not modify right side just the left, before the \":\", and set it to what you want to share between your machines. DO NOT SHARE ROOT ! At least if you are going to make it public. If you want to keep it internal like me, do it if you so wish it's up to you.\n\nNow save the file, and open Terminal inside the folder and run the following command to start it as a Daemon :\n\n```Bash\ndocker compose up -d\n```\n\nIf all was done correctly, you will now be able to access your newly created container via following URLs :\n\n```Bash\nhttp://localhost:443 (Same machine container is on)\nhttp://<server-ip>:443 (From other machines on same network)\n```\n\n### Updating Docker Images\n\nDeploying them images (containers) is nice and all, but now we need to maintain them, as in make sure they are up-to-date. In order to do so, we need to navigate to their respective folders, open terminal there, and run the following commands (FileBrowser) :\n\n```Bash\ndocker compose down (Stop Container)\ndocker compose pull (Pull in latest version)\ndocker compose up -d (Start it up again)\n```\n\nNote :\n\n>Keep in mind that some containers might require us to delete them before grabbing new version. Make sure to read their instructions on that before going forward. I just used what works for our example. Not all Containers function the same way...\n\n### Other tools...\n\nKindly note that there are other tools we could use to make deployment much simpler. I just haven't used them in this guide so you can see how it all works. Tools that can be used are, [Portainer](https://www.portainer.io) and [Dockge](https://dockge.kuma.pet), among many others...\n\n### Nginx Proxy & More...\n\nSo far what we have done here, is deploy container for local access. If you want to access it outside your Network, well, for this you will have to own your own Domain name, set up Nginx Proxy manager, use Cloudflare and so on. But that's for another day. This guide was to get your appetite wet, lol..\n\nI hope you enjoy, and will see you in the next part.\n",
      "downloaded_images": [
        "bbD4JDy.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/docmost-notes/index.md": {
      "original_content": "---\ntitle: \"Docmost Notes\"\ndate: 2024-07-22\ndraft: false\ndescription: \"The Ultimate Wiki for Your Inner Nerd\"\ntags: [\"Docmost\", \"Notes\", \"Docker\", \"Wiki\", \"Self-Hosted\", \"Linux\"]\n---\n{{< youtube ntCyF2nLWZs >}}\n\n### Discover Docmost\n\nEver dreamt of a magical realm where creating, collaborating, and sharing knowledge is as smooth as casting a spell? Welcome to Docmost, the open-source documentation software that's like Hogwarts for your inner nerd. Buckle up for a journey through the enchanted features of [**Docmost**](https://docmost.com).\n\n![Docmost](https://i.imgur.com/lkKoQdi.jpeg)\n\n### Real-Time Collaboration: Dance of the Docs\n\nImagine a symphony of users editing a document at the same time, without stepping on each other's toes. Docmost’s real-time collaboration is like a well-rehearsed dance routine for your documentation. Its rich-text editor is equipped with tables, LaTex for the math wizards, and callouts to highlight those \"aha!\" moments. It's the perfect stage for a collaborative performance.\n\n### Permissions : The Gatekeeper of Knowledge\n\nFor those who like to keep things under control, Docmost's permissions system is your trusty gatekeeper. Decide who gets to view, edit, and manage content like a benevolent ruler of your digital kingdom. Your secrets remain safe, and your wisdom is shared with the chosen few.\n\n### Spaces and Groups: Organized Chaos\n\nIn Docmost, you can organize your content into distinct spaces for different teams, projects, or even your cat's elaborate adventures. User groups allow you to grant permissions efficiently, ensuring everyone has just the right amount of access. It’s like herding cats, but more organized.\n\n### Inline Comments and Page History: The Digital Time Machine\n\nEngage in discussions directly on your pages with inline commenting. It’s like having sticky notes on your documents, but way cooler. And if things go awry, the page history feature is your digital time machine, letting you track changes and revert to previous versions with ease. No flux capacitor required.\n\n### Powerful Search and Nested Pages: Psychic Powers Unleashed\n\nDocmost’s search, powered by Postgres full-text search, is so fast you'll feel like a psychic. Finding information is a breeze. Nested pages and drag-and-drop functionality make organizing your content as satisfying as arranging a puzzle. Everything falls into place effortlessly.\n\n### Attachments Galore: Clip, Click, Done\n\nNeed to attach images or videos? Just paste them directly into Docmost. With support for both S3 and local storage, your visual aids are always at your fingertips. It's as simple as clip, click, done.\n\n### Quick Installation Guide: Summon Docmost in a Jiffy\n\nReady to summon Docmost into your digital realm? Follow these steps for a quick and easy installation:\n\n**Prerequisites :**\n\nBefore you begin, make sure you have Docker installed on your server. See the [**official Docker installation guide**](https://docs.docker.com/engine/install/) based on your OS.\n\n- **Setup the Docker compose file**\n\nCreate a new directory for Docmost and download the Docker compose file with commands below:\n\n```Bash\nmkdir docmost\ncd docmost\ncurl -O https://raw.githubusercontent.com/docmost/docmost/main/docker-compose.yml\n```\n\nNext, open the docker-compose.yml file. On Linux, you can use vim:\n\n```Bash\nvi docker-compose.yml\n```\n\nThe downloaded `docker-compose.yml` file should contain the template below with default environment variables.\n\n- **Replace the default configs :**\n\nYou are to replace the default environment variables in the `docker-compose.yml` file.\n\nThe `APP_URL` should be replaced with your chosen domain. E.g. `https://example.com` or `https://docmost.example.com`.\n\nThe `APP_SECRET` value must be replaced with a long random secret key. You can generate the secret with `openssl rand -hex 32`. If you leave the default value, the app will fail to start.\n\nReplace `STRONG_DB_PASSWORD` in the `POSTGRES_PASSWORD` environment variable with a secure password.\n\nUpdate the `DATABASE_URL` default `STRONG_DB_PASSWORD` value with your chosen Postgres password.\n\nTo configure Emails or File storage driver, see the [**Configuration**](https://docmost.com/docs/self-hosting/configuration) doc. The default File storage driver is `local storage`. You don't have to do anything unless you wish to use S3 storage.\n\n- **Start the Services :**\n\nMake sure you are inside the docmost directory which contains the `docker-compose.yml` file.\n\nTo start the services, run:\n\n```Bash\ndocker compose up -d\n```\n\nOnce the services are up and running, verify the installation by opening your web browser and navigating to: `http://localhost:3000` or the domain that points to your server.\n\nIf all is set, you should see the Docmost setup page which will enable you set up your workspace and account.\n\nAfter a successful setup, you will become the workspace owner. You can then invite other users to join your workspace. Congratulations 🎉.\n\nIf you encounter any issues, feel free to create an issue or discussion on the **GitHub** repo.\n\n{{< github repo=\"docmost/docmost\" >}}\n\n- **Upgrade :**\n\nTo upgrade to the latest Docmost version, run the following commands:\n\n```Bash\ndocker pull docmost/docmost\ndocker compose up --force-recreate --build docmost -d\n```\n\nFor more detailed info visit the >> [**Official Docmost Docs**](https://docmost.com/docs/installation/) Page...\n\n### Embrace the Magic\n\nDocmost is not just a tool; it’s your new best friend for managing wikis, knowledge bases, and documentation. Dive in, collaborate like a pro, and watch your documentation transform into an epic saga. Whether you're a lone wizard or part of a guild, Docmost has the magic to make your documentation dreams come true.\n\n### Wrapping Up\n\nSo there you have it, folks! Docmost is your one-stop solution for all things documentation. It's packed with features that make collaboration smooth and efficient, all while keeping your content organized and easily accessible. Whether you're working on a team project or creating a personal knowledge base, Docmost has everything you need to turn your documentation into a well-oiled machine.\n\nWhy wait? Dive into the world of Docmost and let your documentation journey begin. With its user-friendly interface and powerful features, you'll wonder how you ever managed without it. Happy documenting!\n\nThat’s it folks ..\n\nCheers !\n",
      "downloaded_images": [
        "lkKoQdi.jpeg"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/bato-deck/index.md": {
      "original_content": "---\ntitle: \"Batocera On Deck - Part 1\"\ndate: 2024-07-15\ndraft: false\ndescription: \"Batocera on the Steam Deck\"\ntags: [\"Batocera\", \"Emulation\", \"Retro Gaming\", \"Steam Deck\", \"Deck\", \"SteamDeck\", \"Linux\"]\n---\n\nHey there, retro gamer! Ready to turn your Steam Deck into a time machine for classic games? That's where this guide comes in!\n\n### Batocera\n\n[**Batocera**](https://batocera.org) is an open-source and completely free retro-gaming distribution that can be copied to a USB stick or an SD card with the aim of turning any computer/nano computer into a gaming console during a game or permanently. Batocera.linux does not require any modification on your computer. Note that you must own the games you play in order to comply with the law.\n\n{{< github repo=\"batocera-linux/batocera.linux\" >}}\n\n### Background\n\nLet me start by answering this question, before you ask it. \"What do you mean by Part 1?\". Simple, this guide will be your normal run of the mill about installing [**Batocera**](https://batocera.org) on an SD-Card dual booting it with **SteamOS**.\n\n\"What will you cover in Part 2?\". Well, that's the moment where you will be rolling your eyes, while you call me a weirdo. Part 2 will cover how to wipe **SteamOS** replacing it with **Batocera** on the Deck's internal SSD.\n\n![BatDeck](https://i.imgur.com/ysod9Zp.png)\n\n### The reason why\n\nI for one never cared about playing Triple-A games on that thing. Maybe indie games yes, reason being, I never saw any advantage of going from high FPS to extremely low just to justify my purchase. In my eyes the Deck has always been a monster **Emulation Machine**, no more no less. That's where am gonna leave it. Say what you will, it's my Deck, so I can do with it as I please. Freedom...\n\nNow on with the guide eh ?\n\n### Why Batocera ?\n\nBecause who doesn’t love a good nostalgia trip? Batocera lets you play retro games on your Steam Deck without messing with your Steam library. It runs off a microSD card, so you can keep your games separate and swap systems effortlessly.\n\n### What You Need:\n\nBelow is a list of things you will need before we proceed. I would recommend 2 cards, one you will be using and another as a backup, just in case something goes wrong.\n\n- **MicroSD Card:** A fast U3 A2 card for smooth gameplay.\n- **Batocera Image:** The image we will be using.\n- **Balena Etcher:** Tool for flashing the image onto the microSD card\n- **Steam Deck:** Your ultimate gaming device.\n\n{{< youtube 0GNr6kEI7zM >}}\n\n### Step-by-Step Guide\n\n**1. Download Batocera:**\n\nFirst things first, head over to the [**Batocera Site**](https://batocera.org) and grab the latest image for the Steam Deck. Make sure you select the correct image for your Steam Deck’s architecture – this is crucial to avoid any hiccups later on.\n\n**2. Install Balena Etcher:**\n\nNext up, we need Balena Etcher. This handy tool will flash the Batocera image onto your microSD card. Download it from [**Balena's Site**](https://www.balena.io/etcher), install it on your Steam Deck, and fire it up. It’s super user-friendly, so no need to sweat this part.\n\n**3. Flash Batocera to the microSD Card:**\n\n![Flash](https://i.imgur.com/xZ67kOl.png)\n\nInsert your microSD card into the Steam Deck or use an external card reader if you have one. Open Balena Etcher, select the Batocera image file you just downloaded, and choose your microSD card as the target. Hit the “Flash!” button and watch the magic happen. This process might take a few minutes, so maybe grab a coffee or do a quick victory dance.\n\n**4. Booting into Batocera:**\n\nOnce the flashing is done, insert the microSD card into your Steam Deck. Now, power on the Deck while holding the volume down button to enter the boot menu. Select the microSD card from the boot options, and voila! You’re booting into Batocera. Welcome to the retro world!\n\n![Boot](https://i.imgur.com/NusAyt7.png)\n\n**5. First Time Setup:**\n\nWhen you boot into Batocera for the first time, there are a few housekeeping items to handle:\n\n![Setup](https://i.imgur.com/OTIJjaa.png)\n\n- **Connect to WiFi:** Press the Start button, navigate to Network Settings, and enable WiFi. Select your network and enter the password. You’re online and ready to go!\n- **Configure Controllers:** Most controllers are supported right out of the box. Connect via USB or Bluetooth, then head to Controller Settings to map buttons if needed. Easy peasy.\n- **System Language:** If you prefer a language other than English, go to System Settings and change the language. Now you can navigate in your language of choice.\n\n**6. Adding Your Games:**\n\nThis is where the fun begins. You need to add your game ROMs:\n\n- Connect your Steam Deck to a PC or use the built-in file manager.\n- Transfer your game ROMs to the “share/roms” directory on the microSD card. You can organize them by creating subfolders for each console. Batocera will automatically detect and list your games. It’s like magic!\n\n**7. Customizing Batocera:**\n\nNow, let’s make Batocera your own:\n\n- **Themes:** Go to the UI Settings to change themes and give Batocera a fresh look. There are plenty to choose from, so find one that screams “you.”\nShaders: Enhance your gaming experience with graphical shaders. Find them in the Video Settings. They can make your games look even better than you remember.\n- **Emulator Settings:** Tweak individual emulator settings for optimal performance. This can make a huge difference in how smoothly your games run.\n\n### A Proper Boot Menu\n\nAfter the initial setup, you might find it annoying to hold down the volume key during boot up. We can make this experience much smoother with a boot menu called Clover.\n\n![Clover](https://i.imgur.com/STiHnl1.png)\n\n**Installing Clover:**\n\n1. Ensure the Batocera microSD card is in place.\n2. Boot into SteamOS and access the Steam desktop.\n3. Connect to WiFi if you’re not already connected.\n4. Open the Konsole terminal and type the following commands:\n\n```Bash\ncd ~/\ngit clone https://github.com/ryanrudolfoba/SteamDeck-Clover-dualboot\ncd ~/SteamDeck-Clover-dualboot\nchmod +x install-Clover.sh\n./install-Clover.sh\n```\n\n5. If prompted to set a sudo password, do so and rerun the script with `./install-Clover.sh`.\n6. The script will ask for your sudo password and let you choose the default OS (SteamOS is recommended).\n7. The script will run automatically, setting up Clover. Once done, you’ll see a boot menu every time you start your Steam Deck, allowing you to select your desired environment.\n\n### Troubleshooting Tips\n\nRunning into issues? Here are some quick fixes:\n\n- **Batocera Not Booting:** Double-check that the image was flashed correctly and the microSD card is properly inserted. Sometimes it’s the simple things.\n- **Controller Issues:** Make sure your controllers are fully charged and properly paired. If needed, re-map the buttons in Controller Settings.\n- **Network Problems:** Restart your router or double-check your WiFi settings. Sometimes technology just needs a little nudge.\n- **Slow Performance:** Consider using a faster microSD card or tweaking emulator settings for better performance.\n\n### Bonus Tips:\n\n- **Backup microSD:** Keep a second card with a fresh Batocera image just in case. You never know when you might need it.\n- **Explore Settings:** Batocera is packed with customization options. Take some time to explore and tweak settings to your liking.\n- **BIOS Files:** Some games may require BIOS files. Ensure these are placed in the correct directories for each console.\n\nEnjoy your retro gaming adventure on the Steam Deck! With this guide, you're all set to dive into the golden age of gaming. Happy gaming!\n\n### Wrapping It Up\n\nBefore Batocera, my Steam Deck felt like a reliable but joyless workhorse. Installing Batocera changed everything. It transformed my Deck into a retro gaming paradise, making it feel more like the fun, nostalgic handhelds I love. With the retro magic of Batocera and a proper boot menu, my appreciation for the Deck skyrocketed.\n\nIn short, Batocera brings the joy of retro gaming front and center, making everything feel delightfully vintage and new all at once.\n\nIf you are looking for a much more detailed guide, might I recommend checking either [**Wagner's Tech Talk**](https://wagnerstechtalk.com/sd-batocera/) or [**Retro Handhelds**](https://retrohandhelds.gg/batocera-on-steam-deck-setup-guide/) where I sourced most my material from.\n\nSee you in *Part 2*, in a couple of weeks when my **Steam Deck** is back with me, and have tested my methods before bringing you the guide, just so I am as accurate as possible....\n",
      "downloaded_images": [
        "xZ67kOl.png",
        "STiHnl1.png",
        "OTIJjaa.png",
        "NusAyt7.png",
        "ysod9Zp.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/bluebuild-workshop/index.md": {
      "original_content": "---\ntitle: \"BlueBuild Workshop\"\ndate: 2024-08-01\ndraft: false\ndescription: \"The easiest way to build your own desktop Linux images\"\ntags: [\"uBlue\", \"Distro\", \"Bluefin\", \"Fedora\", \"Atomic\", \"Builder\", \"Linux\"]\n---\n### What is BlueBuild Workshop?\n\n[**BlueBuild**](https://blue-build.org/) is a nifty toolkit for creating custom images of Linux distributions, similar to [**Bluefin**](https://projectbluefin.io). It simplifies the process by allowing you to tweak configurations in a straightforward `recipe.yml` file, perfect for those who want to share their personalized setups. You don't need to be a container wizard or a GitHub guru to get started—basic git and text editor skills will do. Just follow the documentation, ask the friendly community for help, and soon you'll be building custom Linux images like a pro.\n\n{{< github repo=\"blue-build/workshop\" >}}\n\nAll images will be based off of **Fedora** and have **Atomic** elements. No **Debian** or **ArchLinux** bases as of the writing of this post. Maybe in the future? Also this project is totally unrelated to **uBlue** or **Bluefin**.\n\n### What’s a custom image?\n\nPicture this: a custom image in the Linux world is like a gourmet pizza you can switch to without having to bake from scratch every time. So, making your own distro? Well, it’s kind of like claiming you’ve invented pizza when you’re really just adding your favorite toppings. When you’re whipping up custom images, you’re basically taking a tried-and-true Linux distro and sprinkling on your personal favorite apps and settings.\n\nThink of it as curating a playlist with your best jams, but for your operating system. You’re still using the distro’s package manager and repositories, just with a dash of your unique flavor. It’s a lot like sharing your meticulously crafted dotfiles, but instead of just the configs, it’s the whole shebang of the OS with your personalized touch.\n\n### BlueBuild and uBlue Differences\n\n**Universal Blue** is an open source project started by cloud developers that builds amazing custom images based on **Atomic Fedora** along with related experiments, while BlueBuild only builds tools for custom image creation. The project now known as BlueBuild started out as just a part of Universal Blue, but was eventually split from it due to diverging from the scope and being mostly unrelated to the project’s main maintainers.\n\n### Why use it?\n\nTo answer this question, I will say, this is not meant for everyone. But if you are a **FOSS** tinkerer and would like to create your own image(s) with your *ideal* configs and set of tools that anyone could *Rebase* to, then this is for you. This thing is so flexible.\n\n{{< article link=\"/posts/aurora-atomic/\" >}}\n\nJust keep in mind that This isn't a *distro builder*, just a custom image builder. Remember that. Although you can generate ISOs from it, that's not what project was meant to be used for.\n\n### Benefits vs Drawbacks\n\n- **The Benefits**\n\nNow I don't know how to put this, but you can do so much with this thing. As to benefits, I can't say much beyond what I already have. With the right amount of **Linux** knowledge you can take it to another level. You can build images that rival the likes of **Bluefin** and its derivatives to a certain degree using just images no ISOs to maintain, set it n forget it style. It's all up to you & your level of knowledge.\n\n![bluebuild](https://i.imgur.com/4Vs4Yoq.png)\n\n- **The Drawbacks**\n\nThis project is still young, so it will naturally come with some growing pains. As to drawbacks, it doesn't have many if any. The devs are doing a great job with it. The only thing I may not like, is the fact that it's only **Fedora** based, since am an **Arch** user myself. But that's not a drawback at all.\n\n### My thoughts on BlueBuild\n\nI have used this project to create my very own image called **XeroDora** based on the **uBlue Kinoite** image, and at first glance it looked easy enough to pull off. But after digging deeper, as I always do, it's not all as straightforward as I'd hoped. You will hit a few snags, which I find natural with every relatively new **FOSS** project.\n\nOne example being, dependencies. I keep running into this problem over and over and over. However it's unrelated to the project, it's just Fedora being Fedora. Still a newcomer will not be able to differentiate.\n\nOne idea would be to have some sort of error logs for the modules. Like, **BlueBuild** sees that the command failed and provides some help tips. (Thanks **@tulip** for suggestion) which would make it easier to debug.\n\nBottom line is, although devs are doing their best to make the project as easy as possible to use, sometimes issues happen outside project itself that require a lot of Linux know-how to troubleshoot. So as easy as it appears to be, it really isn't as I first thought.\n\nDon't get me wrong here, I still love the project though, and so should you if you like stuff like that. That's why I will keep a close eye on it and see where it goes. I have super high hopes for it. As an Arch user, and ex-Distro maintainer, I see many images being born using this down the line...\n\n> Please do not judge it too harshly just yet. It still has a long way to go. And devs are on the right track. If you encounter any issues, I would highly recommend you join their [**Discord**](https://discord.com/invite/MKhpfbw2) server for help.\n\nThat’s it folks ..\n\nCheers !\n",
      "downloaded_images": [
        "4Vs4Yoq.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/ventoy-multi-boot/index.md": {
      "original_content": "---\ntitle: \"Ventoy - Best multi-boot tool\"\ndate: 2024-06-27\ndraft: false\ndescription: \"Distro-Hopper's best friend\"\ntags: [\"ventoy\", \"usb-boot\", \"multi-boot\", \"distro-hopping\", \"linux\", \"opensource\"]\n---\n### Preface\n\nIn this here post I will be talking about the famous **Ventoy** USB tool. People have asked me many times what USB tool I use to make bootable Linux drives. Well that should answer that question.\n\nBut before I dive deeper into the why I use it over others here some info to get started.\n\n### What's Ventoy exactly?\n\n**Ventoy** creates bootable USB devices using ISO images. That sounds an awful lot like what established programs such as Rufus do at first, but when you realize that it puts the ISO images on the drive and does not extract them, it becomes interesting.\n\nEven better, it is possible to place multiple ISO images on the USB device after it has been prepared by **Ventoy**; this allows you to boot into different Linux systems or install different versions of Windows straight from a single USB device.\n\n{{< youtube 6Mev24M-Bs8 >}}\n\nVentoy even supports Secure Boot. Other than that it also includes support for changing the filesystem of the first partition (ntfs/udf/xfs/ext2/ext3/ext4), persistence support for various Linux distributions such as Ubuntu or Linux Mint, and support for auto-installation.\n\n![Shot1](https://i.imgur.com/x7bmLFq.png)\n\n### Theme Support\n\nAlso, since it uses **GRUB**, naturally, you can theme it. Yes, you read that correctly, it uses Grub themes, so if there’s a theme you like and use, you can apply it to Ventoy. This tool is my go-to as I have so many ISOs and it saves me time and frustration of having to flash a 2GB ISO on one of my 128GB thumb drives wasting space in the process.\n\nI absolutely love this thing. It’s actively being updated. Adding more features, fixing others, and baking in support for more Distros. Just make sure to update the USB stick after updating the app itself, because updating the app alone does not magically update USB. You will have to do that yourself via a small terminal command. Click button below to visit the site and read documentation.\n\n> Note: Ventoy is available as an optional tool in XeroLinux, so no need to download from the official site, or if you are on a different Arch-based distro just grab it from AUR otherwise I think it’s available on Debian repos.\n\n### How to get it ?\n\nWell, there are multiple way to grab this awesome tool, but since we mostly target **ArchLinux** over here I will let you know how to get it for this specific Distro. Below is the link to their **Github** page, but don't get it from there just yet.\n\n{{< github repo=\"ventoy/Ventoy\" >}}\n\nTo get it on **Arch** you first need to have an **AUR** helper installed since it's only available there. You have a choice between [**YaY**](https://github.com/Jguer/yay) or [**Paru**](https://github.com/morganamilo/paru). Select whichever you want, install it then we can grab **Ventoy** via command below...\n\n```Bash\nyay or paru -S ventoy-bin\n```\n\nThat's it ! Enjoy your distro-hopping. Maybe you find the one that fits your needs the best :smile:\n\n",
      "downloaded_images": [
        "x7bmLFq.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/theme-qt-apps-on-gtk-de/index.md": {
      "original_content": "---\ntitle: \"Make KDE apps use System theme in XFCE/Gnome\"\ndate: 2024-06-27\ndraft: false\ndescription: \"Theme QT Apps on GTK DEs\"\ntags: [\"ricing\", \"gtk\", \"kde\", \"plasma\", \"themes\", \"qt\", \"linux\"]\n---\n### Intro\n\nAs I was working on **XFCE** & **Gnome**, I noticed that since they both use **GTK3/4**, some **Qt** apps made for **KDE** like **KdenLive** did not follow the system theme. I found a guide that I will be sharing with you all...\n\nApps built with Q (aka KDE apps) do not look great on the XFCE4 & GNOME desktop because they don’t respect the default theme. The way to fix this is to use **Kvantum**. With it, you can set **KDE** app themes to use a similar theme to what you use.\n\n![Shot1](https://i.imgur.com/UK5MPRI.png)\n\n### Before we begin...\n\nIn this guide, we’ll be using the **Adapta GTK** theme for **XFCE**. We’re focusing on Adapta because it has a **Kvantum** theme that is widely available and helps blend **KDE** apps in with **XFCE4** quite well.\n\nBefore starting this guide, we highly recommend installing the **Adapta GTK** theme onto your Linux PC and enabling it as the default theme in **XFCE**.\n\n### Installing Kvantum on Linux\n\nTo get **Kvantum** working on your Linux PC, you will need to install it alongside the management tool. To get started, open up a terminal window and install the Kvantum manager, as well as everything else necessary to use it.\n\n**Arch Linux**\n\n**Kvantum** is available to Arch Linux users and has been for a very long time. There is an **[AUR package](https://aur.archlinux.org/packages/kvantum-qt5-git/)**. There’s also a package in the official Arch Linux software sources, which we recommend.\n\nTo get the latest Kvantum on your Arch Linux PC, enter the following terminal command.\n\n```Bash\nsudo pacman -S kvantum\n```\n\n**Downloading Kvantum themes**\n\nIn this guide, we’re focusing on the **Kvantum Adapta** theme. However, if you want to use a different GTK theme and need a matching Kvantum theme to go with it, the best place to go is the KDE Store.\n\nThe KDE Store has tons of stuff to download, including Kvantum theme engine themes. To download a Kvantum theme, head over to the **[Kvantum page](https://store.kde.org/browse/cat/123/order/latest/)** on the KDE store. From there, look through the latest themes to download.\n\nOnce you’ve downloaded a theme, launch Kvantum Manager, select “Install/Update Theme,” and install it. Then, select “Change/Delete Theme” to start using it on your system.\n\n### Using Kvantum to make KDE apps look better\n\nTo make your KDE apps look better on the XFCE4 desktop, start by launching “Kvantum Manager” from the app menu. If you cannot find it in the app menu, open up the XFCE4 quick launcher with Alt + F2, and enter “kvantummanager” in the launch box.\n\nOnce the Kvantum Manager app is open on the XFCE4 desktop, follow the step-by-step instructions outlined below.\n\n**- Step 1:** Locate the “Change/Delete Theme” option in the Kvantum Manager. If you cannot find it, it is directly below the “Install/Update Theme.”\n\nAfter selecting the “Change/Delete Theme” button, you will see a menu that says “Select a theme,” followed by a blank text box. Change it to “Kvdapta.”\n\n![Shot2](https://i.imgur.com/JVEudZ1.png)\n\n**- Step 2:** Open up a terminal window and install the Qt5ct app.\n\n```Bash\nsudo pacman -S qt5ct\n```\n\n**- Step 3:** Open up a terminal window and use the **echo** command to edit the profile file to add the environmental variable.\n\n```Bash\necho \"export QT_QPA_PLATFORMTHEME=qt5ct\" >> ~/.profile\n```\n\n**- Step 4:** Log out of your XFCE 4 session and log back in.\n\n**- Step 5:** Open up Qt5ct via the app menu. Or, launch it via the terminal with the **qt5ct** command.\n\n![Shot3](https://i.imgur.com/v261wDF.png)\n\n**Step 6:** Locate the “Appearance” tab. Then, find the “Style” menu. In the menu, select “kvantum.” Then, select “Apply” to apply changes.\n\n![Shot4](https://i.imgur.com/EKMmXrF.png)\n\nUpon applying your changes, KDE applications on XFCE 4 should be using the Kvantum theme set up earlier. This method works the same way on both **XFCE & GNOME**.\n\nGuide by: **[AddictiveTips.com](https://www.addictivetips.com/ubuntu-linux-tips/make-kde-apps-look-better/)**\n",
      "downloaded_images": [
        "v261wDF.png",
        "UK5MPRI.png",
        "EKMmXrF.png",
        "JVEudZ1.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/linux-aliases/index.md": {
      "original_content": "---\ntitle: \"Linux Aliases\"\ndate: 2024-08-27\ndraft: false\ndescription: \"How To Create Your Own Terminal Aliases\"\ntags: [\"Terminal\", \"Alias\", \"Linux\"]\n---\n### Intro\n\nAre you sick and tired of having to type the lengthy update commands in terminal like I am ? Don't you wish there were shorter and easier ones ? Well, you are in luck. This post will cover how you can create your own easy to remember *Aliases*.\n\n### What are aliases?\n\nBasically, they are custom user created commands, by you, that execute various actions. However, I would highly recommend you check if you have any tools installed that have similar ones, and avoid replicating or replacing them.\n\n{{< youtube 4v4Mcncvsac >}}\n\n### How to create Aliases\n\nFirst, before you start, you will have to know what shell you are using, as different ones use different config files. In case of **Bash** you will have to edit the `.bashrc` file found in your home directory's root. And in the case of **ZSH**, it will be the `.zshrc` file found at that same location and so on.\n\nWith that out of the way, the method is the same for both. Just open relevant file in your IDE of choice and let's begin.\n\n![Terminal](https://i.imgur.com/Ks6e0Mn.png)\n\nHere's how aliases are structured :\n\n```Bash\nalias shortcmd=\"actualcmd\"\n```\n\n- Update System (Arch) :\n\n```Bash\nalias up=\"sudo pacman -Syu\"\n```\n\n- Install Package :\n\n```Bash\nalias in=\"sudo pacman -S --needed \"\n```\n\n- Search for Package :\n\n```Bash\nalias search=\"pacman -Ss \"\n```\n\nYou can also use aliases to execute scripts and edit files among many many many other things. They are amazing. I use a ton of them in **XeroLinux**. To check them out visit this link >> [**XeroLinux Aliases**](https://github.com/xerolinux/xero-fixes/blob/main/conf/.bashrc).\n\nQuick examples :\n\n- Edit Pacman.conf\n\n```Bash\nalias npcm=\"sudo nano /etc/pacman.conf\"\n```\n\n- Execute script :\n\n```Bash\nalias cmd=\"/path/to/script/sript.sh\"\n```\n\nYou get the idea. Now save your file, restart your terminal and test them out. The sky's the limit as how many you can create.\n\n### Wrapping up\n\nUsing aliases makes one's Linux journey a much more pleasant one. So do not hesitate to use them. I, like everyone else get frustrated with having to memorize the ones provided by the distro am using. Especially why I test so many. That's the first thing I do when installing a distro. Never again will I go through this ordeal. Anyway I hope this post has proven useful.\n\nThat’s it folks ..\n\nCheers !\n",
      "downloaded_images": [
        "Ks6e0Mn.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/ventoy-persistence/index.md": {
      "original_content": "---\ntitle: \"Ventoy Persistence\"\ndate: 2024-06-26\ndraft: false\ndescription: \"Use Persistence in Ventoy\"\ntags: [\"Ventoy\", \"Multi-Boot\", \"Tools\", \"Linux\", \"USB\"]\n---\n\n### Intro\n\nMost of you might already know about the amazing tool called **Ventoy** and how amazing it is at removing the need to have more USB drives if you want to use multiple ISOs, but you might not know about how many more amazing features it has.\n\nToday I will be showing you how to make a specific Live ISO on your Ventoy USB Drive save all the changes that you make to it.\n\n### The Guide\n\nStarting off you would want to have **Ventoy** installed and copy the folder from `/opt/ventoy` to your USB Drive and renaming it to `ventoy_plugins` or anything else that you might like.\n\n![[Image: Hg7iIzd.png]](https://i.imgur.com/Hg7iIzd.png)\n\nThen go into the `ventoy_plugins` folder open a terminal and run `sudo sh CreatePersistenceImg.sh -s 20480 -l vtoycow` this will create a file called `persistence.dat` with the size of 20GB, refer to [this](https://www.ventoy.net/en/plugin_persistence.html) article from Ventoy for different arguments for the command. After a while you will be granted with this confirmation, just hit `y` and `enter` and in a few seconds it should be done.\n\n![[Image: 8rKKvT4.png]](https://i.imgur.com/8rKKvT4.png)\n\nNow create a new folder called `persistence` in the root folder and move the `persistence.dat` there. Going back to the terminal run `sudo sh VentoyPlugson.sh /dev/sdx` where `x` is your USB Drive id.\n\n![[Image: GElDr8y.png]](https://i.imgur.com/GElDr8y.png)\n\nJust head over to the webaddress that you get from the terminal, there you will be granted with the Ventoy Plugson WebUI. Head over to the `Persistence Plugin` and click on add new and just enter the file paths to the ISO that you want and the `persistence.dat` file and make sure that it says `OK`.\n\n![[Image: PGduHPr.png]](https://i.imgur.com/PGduHPr.png)\n\nNow if you boot into the Xero Linux ISO any changes that you make to it should get saved.\n\nCheers :heart:\n",
      "downloaded_images": [
        "GElDr8y.png",
        "8rKKvT4.png",
        "Hg7iIzd.png",
        "PGduHPr.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/retro-deck/index.md": {
      "original_content": "---\ntitle: \"Batocera On Deck - Part 2\"\ndate: 2024-07-23\ndraft: false\ndescription: \"Replace SteamOS with Batocera on the Steam Deck\"\ntags: [\"Batocera\", \"Emulation\", \"Retro Gaming\", \"Steam Deck\", \"SteamOS\", \"Deck\", \"SteamDeck\", \"Linux\"]\n---\n\nHey there, retro gamer! Are you like me, and prefer to replace **SteamOS** with **Batocera** transforming your Deck into a Retro Gaming powerhouse ? Then this guide is for you...\n\n### Batocera\n\n[**Batocera**](https://batocera.org) is an open-source and completely free retro-gaming distribution that can be copied to a USB stick or an SD card with the aim of turning any computer/nano computer into a gaming console during a game or permanently. Batocera.linux does not require any modification on your computer. Note that you must own the games you play in order to comply with the law.\n\n{{< github repo=\"batocera-linux/batocera.linux\" >}}\n\n### A few notes before we begin\n\nIn case you disagree with the idea behind this guide, and prefer to Dual-Boot **SteamOS** with **Batocera** for whatever reason, fear not I have written a guide covering just that. Find it below.\n\n{{< article link=\"/posts/bato-deck/\" >}}\n\nAlso this guide requires a bit of **Linux** knowledge. Since that method is considered less than ideal by many. The Deck was not made to be used that way so to speak. It's more of a *hack* than an *official* thing.\n\n{{< alert icon=\"fire\" cardColor=\"#e63946\" iconColor=\"#1d3557\" textColor=\"#f1faee\" >}}\n**User Caution**. Tackle this *Only* if you know what you are doing, do it **AT YOUR OWN RISK**. This is a destructive guide, which will wipe any traces of **SteamOS**...\n{{< /alert >}}\n\n### The reason why\n\nI for one never cared about playing Triple-A games on that thing. Maybe indie games yes, reason being, I never saw any advantage of going from high FPS to extremely low just to justify my purchase. In my eyes the Deck has always been a monster **Emulation Machine**, no more no less. That's where am gonna leave it. Say what you will, it's my Deck, so I can do with it as I please. Freedom...\n\nNow on with the guide eh ?\n\n### What You Need:\n\nBelow is a list of things you will need before we proceed. I would recommend 2 cards, one you will be using and another as a backup, just in case something goes wrong.\n\n- **Linux Mint Debian Edition** ISO.\n- **MicroSD Card:** A fast U3 A2 card for ROM storage.\n- **Batocera Image:** The image we will be using.\n- **Balena Etcher:** Tool for flashing the image onto the microSD card\n- **Steam Deck:** Your ultimate gaming device.\n- **Deck Dock** for easy navigation via Keyboard & mouse.\n\n### Step-by-Step Guide\n\n**1. Download LMDE:**\n\nFirst things first, head over to the [**Linix Mint**](https://www.linuxmint.com/download_lmde.php) and grab the latest **Linux Mint Debian Edition** ISO. This is the Distro we will be using temporarily in order to Flash **Batocera** on Deck's internal storage. It's the only one I had on hand that actually worked, surprising isn't it ?\n\n**Booting LMDE**\n\nPut it on your **Ventoy** USB, or flash it on USB stick with **Balena Etcher** choice is yours. Once done, power down the Deck, plug the stick in and boot it while holding the **Volume up + Power**, release power keep holding volume up until you are on the bios screen. Then select **Boot Manager** then choose to boot from the stick you created. This will boot into **LMDE** and get you on the desktop.\n\n**Connecting to WiFi**\n\nI would recommend you be connected over ethernet via *Dongle/Hub* if you can, but if you can't, it's Ok, I will show you how to connect to WiFi.\n\nUsing your mouse n keyboard, click on the WiFi icon in the system tray, select your connection and enter you password. That's it. If you do not have a dongle or hub then it will be more difficult since **LMDE** was not created with the Deck in mind.\n\nYou would have to go into `Settings > Accessibility > Keyboard` and enable it from there. It's up to you really. That's why I would highly recommend you have a *Hub/Dongle/Dock* handy.\n\n**2. Download Batocera:**\n\nNow, head over to the [**Batocera Site**](https://batocera.org) and grab the latest image for the Steam Deck. Make sure you select the correct image for your Steam Deck’s architecture – this is crucial to avoid any hiccups later on.\n\n**3. Install Balena Etcher:**\n\nNext up, we need Balena Etcher. This handy tool will flash the Batocera image onto your microSD card. Download it from [**Balena's Site**](https://www.balena.io/etcher), install it on your Steam Deck, and fire it up. It’s super user-friendly, so no need to sweat this part.\n\n**4. Flash Batocera to Internal Storage:**\n\n![Flash](https://i.imgur.com/xZ67kOl.png)\n\nOpen Balena Etcher, select the Batocera image file you just downloaded, and select the Deck's SSD as the target. Hit the “Flash!” button and watch the magic happen. This process This should be done quick since image is only 3GB in size and you are flashing to a speedy SSD.\n\n**5. Booting into Batocera:**\n\nOnce the flashing is done, power down the Deck and remove the USB. Now, power on the Deck and voila! You’re booting into Batocera. Welcome to the retro world!\n\n![Boot](https://i.imgur.com/3DBBhza.png)\n\n**6. First Time Setup:**\n\nWhen you boot into Batocera for the first time, there are a few housekeeping items to handle:\n\n![Setup](https://i.imgur.com/OTIJjaa.png)\n\n- **Connect to WiFi:** Press the Start button, navigate to Network Settings, and enable WiFi. Select your network and enter the password. You’re online and ready to go!\n- **Configure Controllers:** Most controllers are supported right out of the box. Connect via USB or Bluetooth, then head to Controller Settings to map buttons if needed. Easy peasy.\n- **System Language:** If you prefer a language other than English, go to System Settings and change the language. Now you can navigate in your language of choice.\n\n**7. Adding Your Games:**\n\nThis is where the fun begins. You need to add your game ROMs/Bios Files:\n\n> For security reasons, and to avoid this post from being flagged, I will not be showing where to get any of them from. That's up to you.\n\n- Connect your Steam Deck to a PC or use the built-in file manager.\n- Transfer your game ROMs to the “share/roms” directory on the Deck.\n- Transfer your Bios files too for any 3D/Disc based consoles.\n\nAlthough you can put your ROMs on the Deck's internal SSD, do that only if you have either have enough storage (1tb or more) or as I said earlier, in case you don't, then in **Batocera**'s menu, set the game storage to external and select microSD card (1tb recommended). Especially if you are like me and currently own complete ROM Sets, which can get HUGE ! I mean my PS1 RomSet alone is 600GB.. LoL.\n\nIf you want to do it over WiFi, just use your Distro's file manager, in the address bar head on over to the device's IP adderess that you can get from `Network Settings`.\n\nLike so, `smb://ipaddress`. Keep in mind you will need a functional installation of `SAMBA` for your distro. If you don't know how, I guess it's time to use the power of **Google** lol.\n\nIn short, would be easier to have ROMs on a microSD card than internal storage, simply because you can just plug it into your PC/Laptop n do the transfer that way. Over WiFI would be slow and unreliable. Same with ethernet.\n\n**8. Customizing Batocera:**\n\nNow, let’s make Batocera your own:\n\n- **Themes:** Go to the UI Settings to change themes and give Batocera a fresh look. There are plenty to choose from, so find one that screams “you.”\nShaders: Enhance your gaming experience with graphical shaders. Find them in the Video Settings. They can make your games look even better than you remember.\n- **Emulator Settings:** Tweak individual emulator settings for optimal performance. This can make a huge difference in how smoothly your games run.\n\n### Wrapping It Up\n\nBefore Batocera, my Steam Deck felt like a reliable but joyless workhorse. Installing Batocera changed everything. It transformed my Deck into a retro gaming paradise, making it feel more like the fun, nostalgic handhelds I love. With the retro magic of Batocera, my appreciation for the Deck skyrocketed.\n\nIn short, Batocera brings the joy of retro gaming front and center, making everything feel delightfully vintage and new all at once.\n\nEnjoy your retro gaming adventure on the Steam Deck! With this guide, you're all set to dive into the golden age of gaming. Happy gaming!\n",
      "downloaded_images": [
        "xZ67kOl.png",
        "OTIJjaa.png",
        "3DBBhza.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/nix-package-manager/index.md": {
      "original_content": "---\ntitle: \"Nix Package Manager\"\ndate: 2024-06-28\ndraft: false\ndescription: \"Use the Nix Package Manager Anywhere\"\ntags: [\"Terminal\", \"Packages\", \"NixOS\", \"Nix\", \"Linux\"]\n---\n### Intro\n\nYet again my good friend and Linux enthusiast [**ChriTitus**](https://twitter.com/christitustech/) has brought another cool Package Manager this time called **#Nix**.\n\n{{< youtube Ty8C2B910EI >}}\n\nSeems to be cool and easy to Install and use. Here's the written guide ported directly from his [**ChrisTitusTech**](https://christitus.com/nix-package-manager/) site..\n\n### Installation\n\nInstall Nix using this curl command :\n\n```Bash\ncurl -L https://nixos.org/nix/install | sh\n```\n\nSource\n\n{{< github repo=\"NixOS/nix\" >}}\n\nNote: Recommend multi-user install if it prompts for it.\n\n### Finding Packages\n\nWe recommend using their [**WebStore**](https://search.nixos.org/packages) to find packages to install, but make sure to click the “unstable” button as NixOS stable is a Linux Distribution few use.\n\n![[Image: hLVPjV1]](https://i.imgur.com/hLVPjV1.png)\n\nOr from terminal you can list all packages with `nix-env -qaP` then just `grep` what you are looking for.\n\nExample: `nix-env -qaP | grep hugo`\n\n### Help and Manual\n\nYou can get more details with `man nix` or `man nix-env`\n\n### Troubleshooting\n\nPrograms not showing up in start menu\n\nNIX stores all the .desktop files for the programs it installs @ `/home/$USER/.nix-profile/share/applications/` and a simple symlink will fix them not showing up in your start menu.\n\n```Bash\nln -s /home/$USER/.nix-profile/share/applications/* /home/$USER/.local/share/applications/\n```\n\nEnjoy :heart:\n\n\n",
      "downloaded_images": [
        "hLVPjV1.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/easy-flatpak/index.md": {
      "original_content": "---\ntitle: \"Easy Flatpak Manager\"\ndate: 2024-11-15\ndraft: false\ndescription: \"Manage Flatpaks with ease\"\ntags: [\"Flatpak\", \"Package Manager\", \"Tools\", \"Desktop\", \"Linux\"]\n---\n\n### What is it?\n\n**Easy Flatpak** will help you install Flatpak apps in a user-friendly way. It provides recipes for some of them to install them even better. More in video below. It's in French, so use subs.\n\n{{< youtube BQGybufGzjE >}}\n\nFor example, for Steam, it asks the user to choose a folder where they store their games before installation.\n\n![EasyFlatpak](https://i.imgur.com/xTVwNVj.png)\n\n### Install it\n\nTo install it use the command below, works on any distro no matter what base it uses.\n\n```Bash\nflatpak install flathub org.dupot.easyflatpak -y\n```\n\n{{< github repo=\"imikado/dupotEasyFlatpak\" >}}\n\n### Closing words\n\nI use Flatpaks for almost everything. This app made things even better. It's the first of its kind and hope it continues to develop. I recommend it to everyone...\n\nIt's that simple!!\n",
      "downloaded_images": [
        "xTVwNVj.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/obs-official/index.md": {
      "original_content": "---\ntitle: \"OBS Studio Official Package\"\ndate: 2024-06-27\ndraft: false\ndescription: \"Best way to get OBS-Studio\"\ntags: [\"video\", \"streaming\", \"obs\", \"flatpak\", \"tools\", \"linux\"]\n---\n### What is OBS Studio?\n\n**OBS Studio** is a free and open-source, cross-platform screencasting and streaming app. It is available for Windows, macOS, Linux distributions, and BSD. The OBS Project raises funds on Open Collective and Patreon.\n\n{{< figure src=\"https://i.imgur.com/lDWEJbL.jpeg\" alt=\"obs\" class=\"center-image\" >}}\n\n### Info\n\nWe ship the \"Official\" Flatpak version of OBS-Studio via our toolkit. The best part of it is, we don't just ship the main package alone, we have included some extra plugins too.. Specifically made for the flatpak version.\n\n{{< figure src=\"https://i.imgur.com/nckiQXt.png\" alt=\"obs\" class=\"center-image\" >}}\n\n### Installing it\n\nTo install manually, here's how to grab the entire OBS flatpak plugins via terminal, just copy paste below and hit enter then wait for install to be done...\n\n- Flathub (Flatpak)\n```Bash\nflatpak install -y com.obsproject.Studio com.obsproject.Studio.Plugin.Draw com.obsproject.Studio.Plugin.waveform com.obsproject.Studio.Plugin.WebSocket com.obsproject.Studio.Plugin.TransitionTable com.obsproject.Studio.Plugin.SceneSwitcher com.obsproject.Studio.Plugin.ScaleToSound com.obsproject.Studio.Plugin.OBSVkCapture com.obsproject.Studio.Plugin.OBSLivesplitOne com.obsproject.Studio.Plugin.DistroAV com.obsproject.Studio.Plugin.MoveTransition com.obsproject.Studio.Plugin.Gstreamer com.obsproject.Studio.Plugin.GStreamerVaapi com.obsproject.Studio.Plugin.DroidCam com.obsproject.Studio.Plugin.BackgroundRemoval com.obsproject.Studio.Plugin.AitumMultistream com.obsproject.Studio.Plugin.AdvancedMasks com.obsproject.Studio.Plugin.CompositeBlur com.obsproject.Studio.Plugin.SourceClone com.obsproject.Studio.Plugin.DownstreamKeyer com.obsproject.Studio.Plugin.Shaderfilter com.obsproject.Studio.Plugin.FreezeFilter com.obsproject.Studio.Plugin.SourceRecord com.obsproject.Studio.Plugin._3DEffect org.freedesktop.LinuxAudio.Plugins.x42Plugins\n```\n\n{{< github repo=\"obsproject/obs-studio\" >}}\n\nHave fun :heart:\n",
      "downloaded_images": [
        "lDWEJbL.jpeg",
        "nckiQXt.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/topgrade-updater/index.md": {
      "original_content": "---\ntitle: \"Topgrade AiO Updater\"\ndate: 2024-06-26\ndraft: false\ndescription: \"All-in-One updater tool\"\ntags: [\"Update\", \"All-In-One\", \"TUI\", \"Terminal\", \"Tools\", \"Linux\"]\n---\n\n### Intro\n\nUpgrading Linux has gotten much easier than it used to be. In the old days, you might upgrade certain pieces of software, but mostly you would wait until you bought the next version of your distro of choice. Then you’d install it and marvel at the upgraded software.\n\nPackage management systems have made this easy, but they can’t update every part of your system. What about Ruby Gems or packages you installed via a third-party package manager like Linuxbrew? How will you keep your configuration files synced?\n\n![[Image: Aqqr28I.png]](https://i.imgur.com/Aqqr28I.png)\n\n### What Is Topgrade ?\n\nYou can get a clue of just what Topgrade is meant to do by looking at its GitHub page. Its slogan, written at the top of the page, is “upgrade everything.” That’s exactly what it is meant to do.\n\nWhile we’re focusing on Linux here, Topgrade also works on macOS and Windows. Topgrade is written in Rust, so it should be rather speedy. It’s also licensed under the GNU GPL 3.0, so it’s free as in libre, not just free of charge.\n\n{{< youtube 7i4fBakD7Yw >}}\n\n### What Does Topgrade Update ?\n\nOn Linux it will upgrade your system via its package manager, but that’s just the beginning. It will also upgrade Ruby Gems, Atom packages, Linuxbrew and nix packages, and more. It also upgrades apps installed via Snap or Flatpak. This is far from everything, but it should give you an idea.\n\n![[Image: 5EGo5tK.png]](https://i.imgur.com/5EGo5tK.png)\n\nTopgrade can also upgrade a large portion of your configuration files. It will upgrade your Vim or Neovim configuration if you use NeoBundle, Vundle, Plug, or Dein. If you use a Git repository for your dotfiles, it will also pull any recent changes to them.\n\nYou can also add custom commands for Topgrade to run while upgrading. This is handy if you use some custom scripts you’d like to keep automatically updated.\n\n### Installing Topgrade\n\nIf you run Vanilla Arch, Topgrade is available via the [AUR package](https://aur.archlinux.org/packages/topgrade-bin/). Fortunately, this is fairly easy. On XeroLinux, you can install it with the following commands:\n\n```Bash\nparu -S topgrade-bin\n```\n\n### Using Topgrade\n\nNow that Topgrade is installed, keeping your system up to date is easy. To run Topgrade’s basic update steps, just run the command:\n\n```Bash\ntopgrade\n```\n\n![[Image: lwqfe3q.png]](https://i.imgur.com/lwqfe3q.png)\n\nIf you want to add some custom commands or tweak how Topgrade works, you’ll need to edit its configuration file. On Linux, this is located at `~/.config/topgrade.toml` For example, if you have a list of Git repositories you’d like to refresh, add the following to the file:\n\n```\ngit-repos = [\n    \"~/my-repos/repo_name\",\n]\n```\n\nFor more information on tweaking the configuration file, see the Customization section on the Topgrade **GitHub** page below.\n\n{{< github repo=\"topgrade-rs/topgrade\" >}}\n\n### Conclusion\n\n**Topgrade** gives you a ton of power when it comes to keeping your system up to date. That said, it may be overkill if you just want to keep your system up to date and secure. If you don’t install much third-party software, you may not need Topgrade.\n\nCheers :heart:\n",
      "downloaded_images": [
        "Aqqr28I.png",
        "5EGo5tK.png",
        "lwqfe3q.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/ml4w-hyprland-dots/index.md": {
      "original_content": "---\ntitle: \"M4LW Hyprland Dots\"\ndate: 2024-07-05\ndraft: false\ndescription: \"The Most Advanced Hyprland Dots Ever!\"\ntags: [\"Hyprland\", \"Dots\", \"Ricing\", \"Theming\", \"GTK\", \"Wayland\", \"Linux\"]\n---\n### What is Hyprland?\n\nIn a nutshell, **Hyprland** is a dynamic tiling **Wayland** compositor based on *wlroots* that doesn't sacrifice on its looks. It provides the latest Wayland features, is highly customizable, has all the eyecandy, the most powerful plugins, easy IPC, much more QoL stuff than other wlr-based compositors and more...\n\n### The ML4W Dot Files\n\nBefore getting to it, I would like to say that, while I, myself do not and will not ever be using WMs since my workflow is tailored around DEs, that doesn't mean I do not appreciate the hard work others put into making them more approachable, and pretty to both look at and use.\n\nThat being said, I have been following Hyprland's growth as time went on, especially all the rices being created for it. I have seen so many awesome ones, but the one that caught my eye, which we will be talking about, is the one by a guy named [**@Stephan Raabe**](https://gitlab.com/stephan-raabe).\n\n{{< youtube sVFnd5LAYAc >}}\n\nAs you can see from the video above, he has gone above and beyond the natural limits, making **Hyprland** all that more fun and easy to use by creating *GUI Config Tools* written in **GTK** not only for his dots but you can effortlessly configure almost every aspect of **Hyprland** making it truly your own. It's truly amazing !!!!\n\nHere's a quote from the dev :\n\n> **PLEASE NOTE:** Every Linux distribution and setup can be different. Therefore, I cannot guarantee that the installation will work everywhere. Installation on your own risk.\n\n### How to Install them\n\nBefore we start, just know that the **ML4W** Dotfiles should work on all Arch Linux based distributions, though they have been only tested with the following ones. Support for other Distros like **Fedora** and so on are slowly being added according to Dev.\n\n- Arch Linux (recommended)\n- EndeavourOS\n- Manjaro Linux\n- Garuda Linux\n- Arco Linux\n- XeroLinux w/Hyprland\n\n> For **Manjaro** users: Hyprland and required packages are under ongoing development. That's why it could be possible that some packages are not immediately available on Manjaro. But usually, the packages will be published later. Maybe you can install required packages manually.\n\n> For **ArcoLinux** users: Please reinstall/force the installation of all packages during the installation/update process of the install script. The script will also offer to remove ttf-ms-fonts if installed to avoid issues with icons on waybar.\n\n![ML4W](https://i.imgur.com/amMcyTO.jpeg)\n\nThe installation script will create a backups from configurations of your .config folder that will be overwritten from the installation procedure and previous ML4W Dotfiles installation.\n\nIf possible, please create a snapshot of your current system if snapper or Timeshift is installed and available.\n\nWith main points out of the way, he made installation so simple, as simple as running a script and following prompts. The script will download all files from GitLab and start the installation.\n\nJust copy/enter the following command into your terminal.\n\n```Bash\nbash <(curl -s https://gitlab.com/stephan-raabe/dotfiles/-/raw/main/setup.sh)\n```\n\nOr from the **AUR** using either `yay` or `paru` up to you.\n\n```Bash\nyay/paru -S --noconfirm --needed ml4w-hyprland && ml4w-hyprland-setup\n```\n\nFinally, find link to the **Git Repo** below, or if you want head directly to the project website, click here >> [**MyLinuxForWork**](https://www.ml4w.com)\n\n{{< github repo=\"mylinuxforwork/dotfiles\" >}}\n\nThat’s it folks ..\n\nCheers !\n",
      "downloaded_images": [
        "amMcyTO.jpeg"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/tiling-shell/index.md": {
      "original_content": "---\ntitle: \"Gnome Tiling Shell\"\ndate: 2024-07-17\ndraft: false\ndescription: \"Tile Your Windows in Gnome\"\ntags: [\"Tiling\", \"Extension\", \"Gnome\", \"WM\", \"Shell\", \"Linux\"]\n---\n\nA quick one for today. I do not use **Gnome** myself, but I keep a close eye on what's going on. Recently [**@DistroTube**](https://www.youtube.com/@DistroTube/videos) made a video about an extension that most of you out there might like, so I thought, why not post about it here...\n\n{{< youtube zEe1CqlWKZ0 >}}\n\n### Tiling Shell Information\n\nThis is a Gnome Shell extension implementing modern windows tiling system by extending GNOME's default 2 columns to any layout you want! Can be installed on Gnome Shells from 40 to 46 on X11 and Wayland: the most recent GNOME Shell is supported, and older releases will include all the features and bug fixes!\n\n- 🤩 First and only extension that provides Windows 11's snap assistant\n- 🖥️🖥️ multiple monitors support, even with different scaling factors!\n- ⚙️ Manage, edit, create and delete layouts with a built-in editor\n- 💡 Layouts are not strict, you can span multiple tiles if you want\n- 🚀 Automatically sets the same UI of your GNOME theme, for a seamless integration!\n\n![TilingShell](https://i.imgur.com/a7O9ITP.jpeg)\n\n### Tiling Shell Installation\n\nBefore I tell you how to grab it, let me caution you with this...\n\n{{< alert icon=\"fire\" cardColor=\"#6600FF\" iconColor=\"#66ffff\" textColor=\"#f1faee\" >}}\nGrab it either from the [**Gnome Extenstions**](https://extensions.gnome.org/extension/7065/tiling-shell/) site or via the [**Extension Manager**](https://flathub.org/apps/com.mattjakeman.ExtensionManager) app *Not* the **A.U.R** or any repos.\n{{< /alert >}}\n\nWith that out of the way, I say this coz many have tried grabbing it from the **AUR** only to suffer maintainers lagging behind on updates. It's better to get it straight from source rather than rely on a 3rd party maintainer (man in the middle).\n\n> If you are using the **XeroLinux** toolkit, I added an option that will install everything you need to start customizing your **Gnome** experience. Which includes the **Extension Manager** application, that can be found under the **4 : System Customization** menu.\n\n{{< github repo=\"xerolinuxdev/xlapit-cli\" >}}\n\nNow that you got the extension installed, here's some usage tips.\n\n### Tiling Shell Usage\n\n- **Tiling System**\n\nWhen grabbing and moving a window, press `CTRL` key to show the tiling layout (you can choose another key from the preferences). When moving on a tile, it will highlight. Ungrab the window to place that window on the highlighted tile.\n\n> This extension and the tiling system also implements Windows PowerToys FancyZones!\n\n- **Snap Assistant**\n\nWhen grabbing and moving a window, the snap assistant will be available on top of the screen. Move the window near it to activate the snap assistant. While still grabbing the window, move your mouse to the tile you are interested in. By stopping grabbing the window will be tiled to the selected tile!\n\n- **Select a layout**\n\nClick on Tiling Shell's panel indicator and the available layouts will be shown. Select the one you prefer by clicking on it. That layout will be applied to every monitor in case you have more than one.\n\n- **Select multiple tiles**\n\nThe layout is not strict. You can select multiple tiles too! Just hold ALT while using the tiling system (you can choose another key from the preferences).\n\n* Split a tile : `LEFT CLICK`\n* Split a tile vertically : `LEFT CLICK` + `CTRL`\n* Delete a tile : `RIGHT CLICK`\n* Save, or open the menu : Click the tray icon\n\n- **Smart resize**\n\nYou can resize adjacent tiled windows together!\n\n> It can be enabled/disabled from the preferences\n\n- **Tile using Keyboard**\n\nMove window through the tiles using keyboard shortcuts `(SUPER+←/↑/↓/→)`. They can be customized from the preferences!\n\n- **Edge Tiling**\n\nYou can tile a window by moving it to the edge.\n\n### Wrapping up\n\nThat covers the basics. Now I just copy pasted from project **Git**, where you will find much more info, and can report issues should you encounter any. Here, I linked it below..\n\n{{< github repo=\"domferr/tilingshell\" >}}\n\nEven though I do not like or use **Window Tiling** myself, I think the developer behind this extension was heavily *inspired* by Windows' [**PowerToys Fancy Zones**](https://learn.microsoft.com/en-us/windows/powertoys/fancyzones). I do not find this wrong in the slightest, on the contrary, it's one of Windows' best features IMO. It's nice to see it make its way to **Linux**.\n\nWith Windows constantly shooting itself in the foot, it's fun to see its most useful parts being cherry picked and ported to **Linux**. Windows' loss is **Liinux**'s gain lol. Well, I hope you enjoy this neat little extension...\n\n### Honorable mention\n\nAs a bonus, I would like to mention another *Tiling* extension. But before I mention which, I want you to keep in mind that sometimes this extension, like many others tends to lag behind major **Gnome** releases, so for example when **Gnome 47** lands, you will have to disable it and wait a while before it's updated adding in support.\n\nNow, with **TilingShell** covering newcomers from Windows, the extension am talking about here, is none other than [**Forge**](https://extensions.gnome.org/extension/4481/forge/), specifically targeted to those coming from a *Tiling Window Manager*, who prefer that way of doing things.\n\n![Forge](https://i.imgur.com/ncyrt2L.png)\n\nTo install it use the aforementioned **Extension Manager** app. For more information about its features and how to use it, link to project's **Git** found below. Enjoy your experience on **Gnome** my fellow **FOSS G33ks**...\n\n{{< github repo=\"forge-ext/forge\" >}}\n\nThat’s it folks...\n\nCheers !\n",
      "downloaded_images": [
        "ncyrt2L.png",
        "a7O9ITP.jpeg"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/lightly-shaders/index.md": {
      "original_content": "---\ntitle: \"LightlyShaders Effects\"\ndate: 2024-06-27\ndraft: false\ndescription: \"Add more blur to Windows\"\ntags: [\"ricing\", \"kde\", \"plasma\", \"themes\", \"linux\"]\n---\n### What is it ?\n\nI would like to share a neat little \"Effect\" if you will, called LightlyShaders which is a fork of another project that is a simple KWin/5 effect that simply rounds corners of windows, to do this it uses an opengl shader and is able to round any window, like mpv video for example will have rounded corners.\n\n![[Image: ngDtR0J.jpeg]](https://i.imgur.com/ngDtR0J.jpeg)\n\n{{< alert \"warn\" >}}\n1. This effect is basically a hack!\n\nDue to the changes introduced in Plasma 5.x there is no way to draw original shadows under rounded corners any more. In order to work around that, this fork uses a hack that tries to restore the shadow in the cut out regions based on the data from the closest regions with shadows.\n\nBecause of this it may work differently with different themes, corner radiuses or shadow settings. Your mileage may vary.\n\n2. This effect can be resource-hungry!\n\nThanks to recent changes the performance of this plugin has improved. But depending on your hardware, you still can have performance hit.\n{{< /alert >}}\n\n### Where to get it ?\n\n1- Install Dependencies :\n\n\n```\nsudo pacman -S git make cmake gcc gettext extra-cmake-modules qt5-tools qt5-x11extras kcrash kglobalaccel kde-dev-utils kio knotifications kinit kwin\n```\n\n2- Git Clone Repo & Build :\n\n```\ngit clone https://github.com/a-parhom/LightlyShaders\ncd LightlyShaders; mkdir qt5build; cd qt5build; cmake ../ -DCMAKE_INSTALL_PREFIX=/usr && make && sudo make install && (kwin_x11 --replace &)\n```\n\n3- Enable the Effect :\n\nIt's highly recommended to reboot after install. Once that's done head on over to `Settings > Workspace Behavior > Desktop Effects` and Enable it. Press the Gear if you want to increase/decrease radius...\n\n![[Image: HmT5hnm.png]](https://i.imgur.com/HmT5hnm.png)\n\n\nNote :\n\n> After some updates of Plasma this plugin may need to be recompiled in order to work with changes introduced to KWin.\n\n{{< github repo=\"a-parhom/LightlyShaders\" >}}\n",
      "downloaded_images": [
        "HmT5hnm.png",
        "ngDtR0J.jpeg"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/flatpak-tips/index.md": {
      "original_content": "---\ntitle: \"Flatpak Tips & Tricks\"\ndate: 2024-06-27\ndraft: false\ndescription: \"Use Flatpaks To Their Fullest\"\ntags: [\"Flatpak\", \"Tips\", \"Linux\"]\n---\n### Intro\n\nSlowly and steadily, Flatpak has a growing acceptance in the desktop Linux world.\n\nIt is well integrated into Fedora and many other distributions like Linux Mint, elementary, Solus, etc. prefer it over Ubuntu’s Snap.\n\nIf you love using Flatpak applications, let me share a few tips, tools, and tweaks to make your Flatpak experience better and smoother.\n\n{{< youtube jDVCITRWGgs >}}\n\n### Use Flathub to explore new Flatpak applications\n\nThis one goes without saying.\n\nIf you are looking for new applications in Flatpak packaging, browse the [Flathub](https://flathub.org) website.\n\nThis is the official website from the Flatpak project and it lists and distributes a huge number of Flatpak applications.\n\nYou can look for recommended apps in the “Editor’s choice” section, recently updated apps, new apps and popular apps.\n\n![[Image: iAHc4uB.png]](https://i.imgur.com/iAHc4uB.png)\n\n\nYou can have the application screenshots, description, developer information, and installation instructions on the individual application webpages.\n\n### Use Flatline extension to install Flatpak from the browser\n\nThe [Flathub](https://flathub.org) website provides command line instructions to install the application.\n\nThere is also an Install button but it doesn’t install the application for you. It downloads a `.flatpakref` file and then you’ll have to use the command line to install from the flatpakref file.\n\n![[Image: wovEk8x.png]](https://i.imgur.com/wovEk8x.png)\n\nIf you have to use the command line ultimately, it doesn’t make sense to download the flatpakref file.\n\nYou can make things better by using Flatline. It’s a Browser extension and it makes that Install button useful by converting it into appstream link.\n\nThis way, when you click on the Install button for any application on the [Flathub](https://flathub.org) website, it will ask you to open the link in an XDG application like the Software Center.\n\n* Grab it for Firefox -> [Firefox Add-on](https://addons.mozilla.org/en-US/firefox/addon/flatline-flatpak/)\n* Grab it for Chromium Browsers -> [Chrome Extension](https://chrome.google.com/webstore/detail/flatline/cpbniogoilfagmcoipghkgnpmdglfmjm/related)\n\n![[Image: Nsvf6WO.png]](https://i.imgur.com/Nsvf6WO.png)\n\nThis also means that you should have Fltapak support integrated into the software center.\n\n### Manage Flatpak permissions graphically With Flatseal\n\nFlatseal is a graphical utility to review and modify your Flatpak applications’ permissions. This makes things a lot easier than going through the commands.\n\n![[Image: nf6PVxe.png]](https://i.imgur.com/nf6PVxe.png)\n\nIt lists all the installed Flatpak applications and shows what kind of permissions the selected application has.\n\nYou may enable or disable the permissions. Please bear in mind that disabling some permissions might impact the normal functioning of the application. You should know what you are doing.\n\n### Apply GTK system themes to Flatpak applications\n\nYou might have already noticed that most Flatpak apps don’t change their appearance as per the current system theme.\n\nWhy? Because Flatpak apps run inside a ‘container’ and don’t have access to the host filesystem, network, or physical devices.\n\nYou can choose to install themes as Flatpak to solve this issue. However, your favorite theme might not be available in Flatpak format.\n\nAlternatively, you can make some manual effort and force the Flatpak applications to use a given theme.  Check [This Thread](https://forum.xerolinux.xyz/thread-152.html) to know more...\n\n### Update Flatpak apps and clean them\n\nThis is more for Flatpak unfriendly distributions like Ubuntu. If your distro doesn’t come baked in with Flatpak and you don’t have it integrated with the Software center, your installed Flatpak apps won’t be updated with system updates.\n\nYou can update all your installed Flatpak apps simultaneously with:\n\n```Bash\nflatpak update\n```\n\n![[Image: M6j3R4s.png]](https://i.imgur.com/M6j3R4s.png)\n\n### Conclusion\n\nFlatpak should be the one and only method to deliver apps. Please note I said \"Apps\". There are things that can never be delivered as Flatpaks, like DEs and WMs, among many system related, like Tweaks, Themes, Kernels etc.. So as much as we want a single method for EVERYTHING, sadly that is impossible.. Still Flatpak should overtake the likes of Snaps and AppImages in my opinion...\n",
      "downloaded_images": [
        "iAHc4uB.png",
        "wovEk8x.png",
        "nf6PVxe.png",
        "M6j3R4s.png",
        "Nsvf6WO.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/build-archiso-git/index.md": {
      "original_content": "---\ntitle: \"Build a Bleeding Edge Arch ISO\"\ndate: 2025-05-19\ndraft: false\ndescription: \"Easy Guide to Building a Bleeding Edge Arch ISO\"\ntags: [\"Arch\", \"ArchLinux\", \"ArchISO\", \"Linux\"]\n---\n### Information\n\nSick & Tired of **ArchInstall** breaking ? Well fear not coz this guide will help you build an updated version using latest commits. I mean we can always grab the ISO  from the [**ArchLinux**](https://archlinux.org/download/) site as outdated as it can be. Still knowing how to build a *Bleeding Edge* one can be useful in a bind, am I right ?\n\n<p align=\"center\">\n    <img width=\"500\" src=\"https://i.imgur.com/QWqMIsr.png\" alt=\"logo\">\n</p>\n\n### Let's do this\n\nFirst off we need to grab a few packages in order to be able to build the ISO. Keep in mind that in order to do this you must be on **Arch**. In case you aren't, that's where [**Distrobox**](https://distrobox.it/compatibility/) comes in really handy.\n\n```Bash\nsudo pacman -S archiso\n```\n\nNow we need to clone the repo to grab latest commits. I recommend for you to keep the folder around and `git pull` every now and again to grab latest updates, that way you can always build a fresh new one if and when issues do happen...\n\n```Bash\ngit clone https://github.com/archlinux/archinstall\n```\n\nNow we cd into the directory and make sure script is executable via :\n\n```Bash\ncd archinstall/ && chmod +x build_iso.sh\n```\n\nTime to build the new ISO using :\n\n```Bash\nsudo ./build_iso.sh\n```\n\nOnce build is done, you will find the newly created ISO under `/tmp/archlive/out/` copy it to somewhere safe before proceeding. Finally we can delete the work directory to save space and to be able to build again later on down the line.\n\n```Bash\nsudo rm -rf /tmp/archlive/\n```\n\n### Wrapping up\n\nTest it out and as is the norm by now, if you encounter any issues report them on **Github**. Or if you do not want or know how to use it, they also have their very own [**Discord Server**](https://discord.gg/aDeMffrxNg).\n\n{{< github repo=\"archlinux/archinstall\" >}}\n\nHave fun, I know I will 🚀\n",
      "downloaded_images": [
        "QWqMIsr.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/vmware-linux/index.md": {
      "original_content": "---\ntitle: \"VMware on Linux\"\ndate: 2024-10-07\ndraft: false\ndescription: \"Install VMWare on Linux\"\ntags: [\"VMWare\", \"Virtualization\", \"Tools\", \"Linux\"]\n---\n### Intro\n\nI understand that many of you newcomers to **Linux** from **Windows** sometimes prefer to use **VMWare** coz that's what you are used to. Although I would highly recommend **Virt-Manager** as it's Kernel based. But for you who prefer the former follow the guide below..\n\n<p align=\"center\">\n    <img src=\"https://i.imgur.com/FDUoyg6.png\" alt=\"shot\">\n</p>\n\n### Guide\n\nAll packages compile from the **AUR**, but if you are on **XeroLinux** or have the **Chaotic-AUR** repos they will simply just install, no compilation needed.\n\n- Grab the packages\n\n```Bash\nparu/yay -S vmware-workstation vmware-unlocker-bin vmware-keymaps\n```\n\n- Activate Networking & other services :\n\n```Bash\nsudo modprobe -a vmw_vmci vmmon\nsudo systemctl enable --now vmware-networks.service\nsudo systemctl enable --now vmware-usbarbitrator.service\n```\n\nFinally there's the matter of the Linux Guest OS, to set the correct resolution, it has to come with certain packages but in any case I will show you how to install them and enable. Note that the `xf86-video-vmware` package is for `X11/Xorg` only not for `Wayland` as the name implies.\n\nTo install & enable the service inside Linux guest just run :\n\n```Bash\nsudo pacman -S xf86-video-vmware open-vm-tools\nsudo systemctl enable --now vmtoolsd\n```\n\n### Issues\n\nIf resolution does not get fixed and you are stuck at low, then you might need consult the follwing detailed Docs (Arch) >> [**VMWare Setup**](https://wiki.archlinux.org/title/VMware) or [**VMTools**](https://wiki.archlinux.org/title/VMware/Install_Arch_Linux_as_a_guest#Open-VM-Tools).\n\nIf you are installing another guest, like **Ubuntu**, **Debian** or anything else you will have to find relevant info on your own, I only know and use **Arch**.\n\nYet another tool to add to the arsenal. Best of luck.\n",
      "downloaded_images": [
        "FDUoyg6.png"
      ]
    },
    "/home/techxero/Sites/XeroHub/content/posts/xero-fingerprint/index.md": {
      "original_content": "---\ntitle: \"XeroLinux Fingerprint GUI\"\ndate: 2025-10-06\ndraft: false\ndescription: \"Register your prints with ease on Arch\"\ntags: [\"Fingerprint\", \"Arch\", \"ArchLinux\", \"XeroLinux\", \"Linux\"]\n---\n\n{{< alert icon=\"fire\" cardColor=\"#993350\" iconColor=\"#1d3557\" textColor=\"#f1faee\" >}}\n**Status :** Before you get all excited, this tool was created for **XeroLinux** no other distro. Trying on others will result in failure. However it will be opened up in the future so you can install n use it on the likes of **Debian** and **Fedora** based distros. Source code => [**Here**](https://github.com/XeroLinuxDev/xfprintd-gui)\n{{< /alert >}}\n\n### What is it\n\nOur fingerprint tool is a handy utility created by us in **Rust**, that allows you to use your fingerprint reader to authenticate yourself quickly and securely. With this tool, you can enroll your fingerprint through a simple and intuitive GUI, which creates a digital fingerprint profile stored safely on your system. \n\nOnce set up, it integrates with Linux's authentication framework (such as PAM), letting you log in, or authorize commands like sudo just by placing your finger on the scanner, no need to type your password every time. Setup usually involves installing a package like \"fprintd,\" enrolling your fingerprint via command line, and enabling fingerprint authentication for your login and sudo prompts. This improves both the convenience and security of your Linux experience by using biometrics in place of or alongside passwords.\n\nWe have also taken the time to ensure you do not do anything stupid like locking yourself out of your system. There are checks in place.\n\n### Reasons\n\nThe reason we decided to create this tool is simple, I have a **Thinkpad** laptop with a fingerprint sensor that I didn't want to go to waste, looked for an existing tool that would help with it, but alas I couldn't find one, not on the Arch repos or the **A.U.R**. There was one, but it's from almost a decade ago, making it incompatible with any of the modern scanners. \n\nShould I accept it and move on like so many have done in the past ? Nope, I took this as a challenge. So I sat down, and began work on the GUI. And before you ask, yes I used **ChatGPT Claude A.I** to do it. Remember I am not a developer but an ideas person. Anyway with the GUI in place I went looking for an actual developer who can help bring this idea to life. I have since found one and the rest is history...\n\n### Usage\n\n{{< alert icon=\"fire\" cardColor=\"#993350\" iconColor=\"#1d3557\" textColor=\"#f1faee\" >}}\n**Support :** This tool uses `fprintd` on the backend. It's just a GUI wrapper for it. So sensor support might limited. There's no definitive list of what devices it does or doesn't support. So all you can do is try and see, then report your findings to the `fprintd` devs.\n{{< /alert >}}\n\nThis tool has an intuitive UI, making it easy to understand and use. It has all the checks in place in order to keep it from locking you out of your system. Here's how to use it.\n\n![main](https://i.imgur.com/WUGMuLk.png)\n\nAs you can see from the image above, this is the main screen, click on the **Enroll Fingerprint** button to begin. Note the toggles, they will not be functional until at least one print is registered. Once you have clicked the button, you will be taken to the prints registration page as seen below.\n\n![mng](https://i.imgur.com/LoCci1h.png)\n\nThere, you select which print you want to register. You got all 5 fingers for each hand. Select the one you want to register an you will be taken to the registration page where you can either delete existing print or add new one. To register click the add button and swipe finger as many times as needed until you see the success message like so...\n\n![nroll](https://i.imgur.com/EiR3YeU.png)\n\nOnce registered, you can go back to register more or back to main screen, where you can enable biometric authentication on either, **Login**(i), **Terminal/Sudo** or **Polkit/Prompt**. No more having to type your password over and over and over again. It's amazing and we had fun working on it.\n\n> **(i)** : When it comes to *Login*, the **SDDM Display Manager/Greeter** currently doesn’t *natively* support fingerprint login, as a result it won't display a “scan your finger” message. Click the \"BULB\" icon to know more. It's a \"Hack\" until support is added to **SDDM**, (if ever lol).\n\n### Credits\n\nThis tool wouldn't have been possible if it weren't for my good friend and now **XeroLinux** team member [**Synse**](https://github.com/BananikXenos). He worked tirelessly to bring life to my idea. Please give him a follow on **Github** to show support.\n\nWe will be working on new tools as time passes. Keep an eye out !\n\nCheers !\n",
      "downloaded_images": [
        "LoCci1h.png",
        "EiR3YeU.png",
        "WUGMuLk.png"
      ]
    }
  }
}